Repository: ministryofjustice/grc-app
Catalog: grc/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: something that’s equal to a Gender Recognition Certificate
cy: Rhywbeth sy'n cyfateb i Dystysgrif Cydnabod Rhywedd

source: an updated birth certificate
cy: Tystysgrif geni wedi'i diweddaru

source: a court order
cy: gorchymyn llys

source: an entry in a legal register
cy: cofnod mewn cofrestr gyfreithiol

source: Documents to send by post
cy: Dogfennau i'w hanfon drwy'r post

source: If you’re unable to confirm your identity online, you should post the following documents after you have submitted your application.
cy: Os nad ydych yn gallu cadarnhau eich hunaniaeth ar-lein, dylech bostio’r dogfennau canlynol ar ôl i chi gyflwyno eich cais.

source: Birth or adoption certificate
cy: Tystysgrif geni neu fabwysiadu

source: If any of your documents are not in English
cy: Os nad yw unrhyw un o'ch dogfennau yn Saesneg

source: You’ll need to have your documents translated
cy: Bydd angen i'ch dogfennau gael eu cyfieithu

source: The translator does not need to have any qualifications, so the translation can be done by a friend or a family member
cy: Nid oes angen i'r cyfieithydd feddu ar unrhyw gymwysterau, felly gall ffrind neu aelod o'r teulu wneud y cyfieithiad

source: Get the translator to sign the translated documents and write down their translation qualifications if they have any
cy: Gofynnwch i'r cyfieithydd lofnodi'r dogfennau wedi'u cyfieithu ac ysgrifennu eu cymwysterau cyfieithu os oes ganddynt rai

source: You’ll need to send in both the original documents and the translations
cy: Bydd angen i chi anfon y dogfennau gwreiddiol a'r cyfieithiadau atom

source: apply for a Gender Recognition Certificate
cy: gallwch wneud cais am Dystysgrif Cydnabod Rhywedd

source: Get this list by email
cy: Cael y rhestr hon drwy e-bost

source: If you want us to email you the list of documents, please click this button
cy: Os ydych chi eisiau i ni anfon y rhestr o ddogfennau atoch drwy e-bost, cliciwch y botwm hwn

source: Email documents list
cy: Anfon y rhestr o ddogfennau drwy e-bost

source: Share your feedback
cy: Rhannu eich adborth

source: Please tell us about your experience filling in your Gender Recognition Certificate application using this digital service.
cy: Dywedwch wrthym am eich profiad o gwblhau cais am Dystysgrif Cydnabod Rhywedd gan ddefnyddio’r gwasanaeth digidol hwn.

source: Warning
cy: Rhybudd

source: Please don’t include any information that could be used to identify you.
cy: Peidiwch â chynnwys unrhyw wybodaeth a allai eich adnabod.

source: If you have any questions about your application, please contact the admin team.
cy: Os oes gennych unrhyw gwestiynau am eich cais, cysylltwch â’r tîm gweinyddol.

source: How easy was it to complete your application?
cy: Pa mor hawdd oedd cwblhau eich cais?

source: Did you find any of the questions difficult to answer?
cy: A oedd unrhyw un o’r cwestiynau yn anodd i’w hateb?

source: Which questions did you find difficult, and why?
cy: Pa gwestiynau oedd yn anodd i chi, a pham?

source: Did you need to call the admin team for help with your application?
cy: A oedd rhaid i chi ffonio’r tîm gweinyddol i gael help gyda’ch cais?

source: What did you need help with?
cy: Ar gyfer beth oedd arnoch chi angen cymorth?

source: Did you use the tool to check which documents you needed to submit with your application?
cy: A wnaethoch chi ddefnyddio’r adnodd i wirio pa ddogfennau yr oedd angen i chi eu cyflwyno gyda’ch cais?

source: How was your experience using the tool?
cy: Sut oedd eich profiad o ddefnyddio'r offeryn?

source: Do you have any other suggestions for improving the digital service?
cy: A oes gennych chi unrhyw awgrymiadau eraill ar gyfer gwella’r gwasanaeth digidol?

source: Send feedback
cy: Anfon adborth

source: Feedback received
cy: Adborth wedi’i dderbyn

source: Thank you for your feedback
cy: Diolch am eich adborth

source: Return to your application
cy: Dychwelyd i’ch cais

source: Return to the Gender Recognition Certificate service
cy: Dychwelyd i’r gwasanaeth Tystysgrif Cydnabod Rhywedd

source: Return to your list of documents needed to apply for a Gender Recognition Certificate
cy: Dychwelyd at eich rhestr o ddogfennau sydd eu hangen i wneud cais am Dystysgrif Cydnabod Rhywedd

source: Return to check documents needed to apply for a Gender Recognition Certificate
cy: Dychwelyd i wirio’r dogfennau sydd eu hangen i wneud cais am Dystysgrif Cydnabod Rhywedd

source: Change
cy: Newid

source: Back
cy: Yn ôl

source: Return to task list
cy: Yn ôl i’r rhestr tasgau

source: From
cy: Oddi wrth

source: To
cy: At

source: Remove date range
cy: Dileu'r ystod dyddiad

source: Add another date range
cy: Ychwanegu ystod dyddiad arall

source: There is a problem
cy: Mae yna broblem

source: Currently married or in a civil partnership
cy: Wedi priodi neu mewn partneriaeth sifil ar hyn o bryd

source: Spouse or partner has died
cy: Mae fy mhriod neu fy mhartner wedi marw

source: Marriage or civil partnership has ended
cy: Mae ein priodas neu bartneriaeth sifil wedi dod i ben

source: Interim GRC
cy: Tystysgrif Cydnabod Rhywedd Interim

source: Marriages and civil partnerships
cy: Priodasau a phartneriaethau sifil

source: If you’ve ever been married or in a civil partnership, you need to upload a scan or good quality photograph of your marriage or civil partnership certificates.
cy: Os ydych erioed wedi bod yn briod neu mewn partneriaeth sifil, bydd angen i chi uwchlwytho sgan neu lun o ansawdd da o’ch tystysgrif priodas neu’ch tystysgrif partneriaeth sifil.

source: If you are in the process of ending, or you plan to end your marriage or civil partnership, you should select your current legal status
cy: Os ydych yn y broses o ddod â’ch priodas neu bartneriaeth sifil i ben, neu os ydych yn bwriadu dod â’ch priodas neu bartneriaeth sifil i ben, dylech ddewis eich statws cyfreithiol ar hyn o bryd.

source: Have you ever been married or in a civil partnership that ended?
cy: A ydych chi erioed wedi bod yn briod neu mewn partneriaeth sifil a ddaeth i ben?

source: If yes, you will need to provide a copy of your decree(s) dissolving the marriage or civil partnership
cy: Os ‘Ydw’ bydd angen i chi ddarparu copi o’ch datganiad(au) yn diddymu’r briodas neu bartneriaeth sifil

source: Interim Gender Recognition Certificate
cy: Tystysgrif Cydnabod Rhywedd Interim

source: Declaration of consent
cy: Datganiad o gydsyniad

source: Title
cy: Teitl

source: Postal address – including postcode or zip code
cy: Cyfeiriad ar gyfer postio - gan gynnwys cod post neu god sip

source: Were you previously married or in a civil partnership and your spouse or partner died?
cy: A oeddech chi’n arfer bod yn briod neu mewn partneriaeth sifil, ond bod eich priod neu bartner sifil wedi marw?

source: If yes, you will need to provide a copy of their death certificate
cy: Os ‘Ydw’, bydd angen i chi ddarparu copi o’u tystysgrif marwolaeth

source: What is your address?
cy: Beth yw eich cyfeiriad?

source: This should be the address that you want us to send your Gender Recognition Certificate to
cy: Dylech roi’r cyfeiriad yr ydych eisiau i ni ei ddefnyddio i anfon eich Tystysgrif Cydnabod Rhywedd iddo

source: Address line 1
cy: Llinell gyntaf y cyfeiriad

source: Address line 2 (optional)
cy: Ail linell y cyfeiriad (dewisol)

source: Town or city
cy: Tref neu ddinas

source: Country (optional)
cy: Gwlad (dewisol)

source: Postcode or zipcode
cy: Cod post neu god sip

source: What is your affirmed gender?
cy: Beth yw eich rhywedd a gadarnhawyd?

source: This will appear on your Gender Recognition Certificate.
cy: Bydd hwn yn ymddangos ar eich Tystysgrif Cydnabod Rhywedd.

source: Name
cy: Enw

source: Affirmed gender
cy: Rhywedd a gadarnhawyd

source: When you transitioned
cy: Pan wnaethoch drawsnewid

source: When you signed your statutory declaration
cy: Pan wnaethoch lofnodi eich datganiad statudol

source: Ever changed name
cy: Erioed wedi newid enw

source: Address
cy: Cyfeiriad

source: Phone
cy: Ffôn

source: Contact preferences
cy: Dewisiadau cyswllt

source: Unavailable over the next 6 months
cy: Ddim ar gael yn y 6 mis nesaf

source: Notify HMRC
cy: Hysbysu HMRC

source: National insurance number
cy: Rhif Yswiriant Gwladol

source: If we need to contact you by post in the next 6 months, are there any dates we should avoid?
cy: Os bydd arnom angen cysylltu â chi drwy’r post yn y 6 mis nesaf, a oes unrhyw ddyddiadau y dylid eu hosgoi?

source: For example, 31 8 2023
cy: Er enghraifft, 31 8 2023

source: For example, if you are away on holiday. The Gender Recognition Panel admin team will not contact you during this time - but other government departments such as HMRC might still contact you.
cy: Er enghraifft, os ydych i ffwrdd ar wyliau. Ni fydd tîm gweinyddol y Panel Cydnabod Rhywedd yn cysylltu â chi yn ystod y cyfnod hwn - ond efallai y bydd adrannau eraill y llywodraeth, megis HMRC yn cysylltu â chi.

source: Insert date to avoid
cy: Rhowch ddyddiad i’w osgoi

source: Insert dates to avoid
cy: Rhowch ddyddiadau i'w hosgoi

source: How would you like to be contacted if we have any questions about your application?
cy: Sut yr hoffech i ni gysylltu â chi ynghylch eich cais?

source: Email address
cy: Cyfeiriad e-bost

source: Phone number
cy: Rhif ffôn

source: Notifying HMRC
cy: Hysbysu HMRC

source: HMRC must be told if you have received a Gender Recognition Certificate.
cy: Rhaid dweud wrth HMRC os ydych wedi cael Tystysgrif Cydnabod Rhywedd.

source: If you usually pay tax in the UK, we can tell HMRC on your behalf.
cy: Os ydych fel arfer yn talu treth yn y DU, yna gallwn ni ddweud wrth HMRC ar eich rhan.

source: HMRC will update its records with your gender and any name change, and they will tell the Department for Work and Pensions.
cy: Bydd HMRC yn diweddaru ei gofnodion gyda’ch rhywedd a’ch newid enw, a byddant yn dweud wrth yr Adran Gwaith a Phensiynau.

source: They will send you a letter to confirm the changes.
cy: Byddant yn anfon llythyr atoch i gadarnhau’r newidiadau.

source: If you prefer,
cy: Os byddai’n well gennych,

source: you can tell HMRC yourself (opens in a new tab)
cy: gallwch chi ddweud wrth HMRC eich hun (yn agor mewn tab newydd)

source: If you pay tax in the Isle of Man or Channel Islands, please select ‘No’ and tell HMRC yourself.
cy: Os ydych chi’n talu treth yn Ynys Manaw neu Ynysoedd y Sianel, dewiswch ‘Na’ a dywedwch wrth HMRC eich hun.

source: Would you like us to tell HMRC after you receive a Gender Recognition Certificate?
cy: A hoffech i ni ddweud wrth HMRC ar ôl i chi gael eich Tystysgrif Cydnabod Rhywedd?

source: What is your National Insurance number?
cy: Beth yw eich rhif Yswiriant Gwladol?

source: It’s on your National Insurance card, benefit letter, payslip or P60. For example, ‘QQ 12 34 56 C’.
cy: Bydd ar eich cerdyn Yswiriant Gwladol, llythyrau budd-daliadau, slip cyflog neu P60. Er enghraifft, ‘QQ 12 34 56 C’

source: What is your name?
cy: Beth yw eich enw?

source: Enter your name exactly as it appears on either your latest change of name document or your birth certificate
cy: Rhowch eich enw yn union fel y mae’n ymddangos ar naill ai eich dogfen newid enw ddiweddaraf neu eich tystysgrif geni

source: This will appear in full on your Gender Recognition Certificate
cy: Bydd hwn i’w weld yn llawn ar eich Tystysgrif Cydnabod Rhywedd

source: If you want to use a different name from your birth certificate or change of name document, you should
cy: Os ydych eisiau defnyddio enw gwahanol o’ch tystysgrif geni neu ddogfen newid enw, dylech

source: change your name by deed poll (opens in a new tab)
cy: newid eich enw drwy weithred newid enw (yn agor mewn tab newydd)

source: before you apply for a Gender Recognition Certificate
cy: cyn i chi wneud cais am Dystysgrif Cydnabod Rhywedd

source: For internal use only. This will not appear on your Gender Recognition Certificate.
cy: At ddefnydd mewnol yn unig. Ni fydd hwn yn ymddangos ar eich Tystysgrif Cydnabod Rhywedd.

source: You will need to upload documents that show this
cy: Bydd angen i chi uwchlwytho dogfennau sy'n dangos hynny

source: When did you sign your statutory declaration?
cy: Pryd wnaethoch chi arwyddo eich Datganiad Statudol?

source: Enter the date you signed your gender recognition statutory declaration in front of someone authorised to administer oaths.
cy: Rhowch y dyddiad pan wnaethoch lofnodi eich datganiad statudol cydnabod rhywedd ym mhresenoldeb rhywun sydd wedi’i awdurdodi i weinyddu llwon.

source: When did you transition?
cy: Pryd wnaethoch chi drawsnewid o un rhywedd i’r llall?

source: Enter the month and year of your transition
cy: Rhowch fis a blwyddyn eich trawsnewidiad

source: For example, this could be when you changed your name by deed poll, or when you told friends or family you were changing your gender
cy: Er enghraifft, gallai hyn fod yr adeg pan wnaethoch newid eich enw drwy weithred newid enw, neu pam ddywedoch wrth eich teulu neu ffrindiau eich bod yn newid eich rhywedd

source: The date must be the same as on your gender recognition statutory declaration
cy: Rhaid i’r dyddiad fod yr un fath â’r dyddiad sydd ar eich datganiad statudol cydnabod rhywedd

source: It must be at least 2 years before you submit your application for a Gender Recognition Certificate
cy: Rhaid iddo fod o leiaf 2 flynedd cyn i chi gyflwyno’ch cais am Dystysgrif Cydnabod Rhywedd

source: Accessibility statement for Gender Recognition Certificate application service
cy: Datganiad hygyrchedd ar gyfer y gwasanaeth gwneud cais am Dystysgrif Cydnabod Rhywedd

source: We want everyone to be able to do what they need to do with our website, regardless of any access needs due to a disability or condition
cy: Rydym eisiau i bawb allu gwneud yr hyn sydd angen iddynt ei wneud gyda’n gwefan, boed unrhyw anghenion mynediad oherwydd anabledd neu gyflwr

source: A detailed accessibility statement about the Gender Recognition Certificate application service
cy: Datganiad hygyrchedd manwl am y gwasanaeth gwneud cais am Dystysgrif Cydnabod Rhywedd

source: This page describes:
cy: Mae’r dudalen hon yn disgrifio:

source: how accessible our website is
cy: pa mor hygyrch yw ein gwefan

source: what to do if you have a problem
cy: beth i’w wneud os oes gennych broblem

source: what we are doing to meet the regulations
cy: beth rydym yn ei wneud i fodloni'r rheoliadau

source: This accessibility statement applies to the Gender Recognition Certificate application service and document checker
cy: Mae’r datganiad hygyrchedd hwn yn berthnasol i’r gwasanaeth gwneud cais am Dystysgrif Cydnabod Rhywedd a’r gwiriwr dogfennau

source: It does not apply to the guidance about Gender Recognition Certificates on GOV.UK
cy: Nid yw'n berthnasol i'r canllawiau ynghylch Tystysgrifau Cydnabod Rhywedd ar GOV.UK

source: Using our website and services
cy: Defnyddio ein gwefan a'n gwasanaethau

source: This service is run by the Government Equalities Office
cy: Mae’r gwasanaeth hwn yn cael ei gynnal gan Swyddfa Cydraddoldeb y Llywodraeth

source: We want as many people as possible to be able to use this website
cy: Rydym eisiau i gymaint o bobl â phosibl allu ei defnyddio

source: For example, that means you should be able to:
cy: Er enghraifft, golyga hyn y dylech allu:

source: zoom in up to 300%% without problems
cy: Chwyddo’r dudalen hyd at 300%% heb broblemau

source: navigate most of the website using just a keyboard
cy: mynd drwy'r rhan fwyaf o'r wefan gan ddefnyddio bysellfwrdd yn unig

source: navigate most of the website using speech recognition software
cy: mynd drwy'r rhan fwyaf o'r wefan gan ddefnyddio meddalwedd adnabod llais

source: use most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: defnyddio’r rhan fwyaf o’r wefan gan ddefnyddio darllenydd sgrin (gan gynnwys fersiynau diweddaraf JAWS, NVDA a VoiceOver)

source: We have also made the website text as simple as possible to understand
cy: Rydym hefyd wedi sicrhau ein bod wedi defnyddio iaith syml ar y wefan

source: AbilityNet (opens in a new tab)
cy: Mae gan AbilityNet (agor mewn ffenestr newydd)

source: has advice on making your device easier to use if you have a disability
cy: gyngor ar wneud eich dyfais yn haws i’w defnyddio os oes gennych anabledd

source: How accessible this website is
cy: Pa mor hygyrch yw'r wefan hon

source: We aim to meet international accessibility guidelines, however this may not always be possible, or we may have missed a problem
cy: Ein nod yw bodloni canllawiau hygyrchedd rhyngwladol, ond efallai na fydd hyn bob amser yn bosibl, neu efallai ein bod wedi methu problem mewn camgymeriad

source: We know some parts of this website are not fully accessible
cy: Gwyddwn nad yw rhai rhannau o’r wefan hon yn gwbl hygyrch

source: most older PDF documents that are linked to from this website are not fully accessible to screen reader software
cy: nid yw’r rhan fwyaf o ddogfennau PDF hŷn a geir o'r wefan hon yn gwbl hygyrch i feddalwedd darllenydd sgrin

source: some GOV.UK Pay pages are not accessible, but we do not manage these pages – see the
cy: nid yr rhai tudalennau GOV.UK Pay yn hygyrch, ond nid ydym yn rheoli’r tudalennau hyn –

source: GOV.UK Pay accessibility statement (opens in a new tab)
cy: gweler y datganiad hygyrchedd GOV.UK Pay (yn agor mewn tab newydd)

source: for more information
cy: am fwy o wybodaeth

source: We are working to fix the issue with inaccessible PDFs
cy: Rydym yn gweithio i ddatrys y broblem gyda PDFs anhygyrch

source: What to do if you cannot access parts of this website
cy: Beth i'w wneud os na allwch ddefnyddio rhai rhannau o'r wefan hon

source: If you need information on this website in a different format like accessible PDF, large print, easy read, audio recording or braille, contact
cy: Os ydych angen gwybodaeth sydd ar y wefan hon mewn fformat arall megis ar ffurf PDF hygyrch, print bras, fformat hawdd ei ddeall, recordiad sain neu braille, cysylltwch â

source: We will consider your request and get back to you within 5 working days
cy: Byddwn yn ystyried eich cais ac yn ymateb o fewn 5 diwrnod gwaith

source: Reporting accessibility problems with this website
cy: Riportio problemau hygyrchedd gyda'r wefan hon

source: We are always looking to improve the accessibility of this website
cy: Rydym o hyd yn ceisio gwella hygyrchedd y wefan hon

source: If you find any problems not listed on this page, or think we are not meeting accessibility requirements, contact
cy: Os byddwch yn dod ar draws unrhyw broblem sydd heb ei chynnwys ar y dudalen hon, neu’n credu nad ydym yn bodloni’r gofynion o ran hygyrchedd, cysylltwch â

source: Enforcement procedure
cy: Y Weithdrefn Orfodi

source: The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (the ‘accessibility regulations’)
cy: Y Comisiwn Cydraddoldeb a Hawliau Dynol (EHRC) sy’n gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018 (y ‘rheoliadau hygyrchedd’)

source: If you’re not happy with how we respond to your complaint, contact the
cy: Os nad ydych chi’n fodlon gyda’r ffordd rydym yn ymateb i’ch cwyn, cysylltwch â’r

source: Equality Advisory and Support Service (EASS) (opens in a new tab)
cy: Gwasanaeth Cynghori a Chymorth Cydraddoldeb (EASS) (agor mewn tab newydd)

source: Technical information about this website’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan hon

source: The Government Equalities Office is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018
cy: Mae Swyddfa Cydraddoldeb y Llywodraeth wedi ymrwymo i sicrhau bod ei wefannau yn hygyrch, a hynny yn unol â Rheoliadau Hygyrchedd Cyrff y Sector Gyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018

source: This website is partially compliant with the
cy: Mae’r wefan hon yn cydymffurfio’n rhannol â safon

source: Web Content Accessibility Guidelines version 2.1 (opens in a new tab)
cy: AA Canllawiau Hygyrchedd Cynnwys Gwe fersiwn 2.1 (yn agor mewn tab newydd)

source: AA standard, due to ‘the non-compliances’, listed below
cy: , a hynny oherwydd yr enghreifftiau o beidio â chydymffurfio a restrir isod

source: Non-accessible content
cy: Cynnwys anhygyrch

source: The content listed below is not accessible for the following reasons
cy: Nid yw’r cynnwys a restrir isod yn hygyrch am y rhesymau canlynol

source: Statutory declaration PDFs have not been marked up with tags or text descriptions – this makes it difficult for people with screen readers to use them
cy: Nid yw PDFs datganiad statudol wedi’u marcio â thagiau na disgrifiadau testun – mae hyn yn ei gwneud hi’n anodd i bobl sydd â darllenwyr sgrin i’w defnyddio

source: Non-compliance with the accessibility regulations
cy: Diffyg cydymffurfio â’r rheoliadau hygyrchedd

source: Statutory declaration PDFs have not been marked up with tags or text descriptions
cy: Nid yw PDFs datganiad statudol wedi’u marcio â thagiau neu ddisgrifiadau testun

source: This makes it difficult for people with screen readers to use them
cy: Mae hyn yn ei gwneud hi’n anodd i bobl sydd â darllenwyr sgrin i’w defnyddio

source: We are aware of these issues and are working to fix them
cy: Rydym yn ymwybodol o’r problemau hyn ac yn gweithio i’w datrys

source: Disproportionate burden
cy: Baich anghymesur

source: We have not yet identified a part of the service where it would be a disproportionate burden on the Government Equalities Office to resolve the non-compliance
cy: Nid ydym eto wedi cydnabod rhan o’r gwasanaeth lle byddai’n faich anghymesur ar Swyddfa Cydraddoldeb y Llywodraeth i ddatrys yr achosion o ddiffyg cydymffurfio

source: If this becomes the case, we will publish full details here explaining our decision
cy: Os daw hyn yn wir, byddwn yn cyhoeddi manylion llawn yma yn egluro ein penderfyniad

source: How we tested
cy: Sut wnaethon ni gynnal profion

source: Testing has been conducted internally by Government Equalities Office staff and externally audited by the
cy: Cynhaliwyd profion yn fewnol gan staff Swyddfa Cydraddoldeb y Llywodraeth a’u harchwilio’n allanol gan y

source: Digital Accessibility Centre (opens in a new tab)
cy: Ganolfan Hygyrchedd Digidol (yn agor mewn tab newydd)

source: Where they have been checked for compliance, it has been against WCAG 2.1 AA
cy: Lle cawsant eu gwirio am gydymffurfiaeth, mae wedi bod yn erbyn WCAG 2.1 AA

source: What we are doing to improve accessibility
cy: Beth rydym yn ei wneud i wella hygyrchedd

source: We are working to fix any parts of the service which are not accessible
cy: Rydym yn gweithio i fynd i’r afael ag unrhyw rannau o'r gwasanaeth nad ydynt yn hygyrch

source: Preparation of this accessibility statement
cy: Paratoi’r datganiad hygyrchedd hwn

source: This statement was prepared on 7th June 2022. It was last reviewed on 7th June 2022
cy: Paratowyd y datganiad hwn ar 7 Mehefin 2022. Adolygwyd ddiwethaf ar 7 Mehefin 2022

source: This website was last tested on 26th May 2022
cy: Profwyd y wefan hon ddiwethaf ar 26 Mai 2022

source: The test was carried out by the Digital Accessibility Centre
cy: Cynhaliwyd y prawf gan y Ganolfan Hygyrchedd Digidol

source: You’ve set your cookie preferences
cy: Rydych wedi cadw eich dewisiadau cwcis

source: GOV.UK Gender Recognition Certificate
cy: Mae Tystysgrif Cydnabod Rhywedd GOV.UK

source: puts small files (known as ‘cookies’) on your computer
cy: yn gosod ffeiliau bychain (a elwir yn cwcis) ar eich cyfrifiadur
