Repository: ministryofjustice/grc-app
Catalog: grc/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Completed
cy: Wedi'i gwblhau

source: In progress
cy: Yn mynd rhagddo

source: Not started
cy: Heb ddechrau

source: Cannot start yet
cy: Methu dechrau eto

source: In Review
cy: Yn cael ei adolygn

source: Yes
cy: Ydw

source: No
cy: Nac ydw

source: I don't know
cy: Dydw i ddim yn gwybod

source: Married
cy: Wedi priodi

source: Civil partnership
cy: Mewn partneriaeth sifil

source: Neither
cy: Ddim un ohonynt

source: Australia - only includes the Australian Capital Territory, New South Wales, Queensland and Western Australia
cy: Awstralia - dim ond yn cynnwys Prifddinas-diriogaeth Awstralia, De Cymru Newydd, Queensland a Gorllewin Awstralia

source: Belarus
cy: Belarws

source: Bosnia and Herzegovina
cy: Bosnia a Herzegovina

source: China
cy: Tsieina

source: Cuba
cy: Ciwba

source: Republic of Cyprus
cy: Gweriniaeth Cyprus

source: Czech Republic
cy: Gweriniaeth Tsiec

source: Germany
cy: Almaen

source: Italy
cy: Eidal

source: Romania
cy: Rwmania

source: Slovakia
cy: Slofacia

source: South Africa
cy: De Affrica

source: South Korea
cy: De Corea

source: Turkey
cy: Twrci

source: Ukraine
cy: Wcráin

source: United States of America – only includes Alabama, Alaska, Arizona, Arkansas, Connecticut, Delaware, Georgia, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maryland, Massachusetts, Missouri, Nebraska, New Hampshire, North Carolina, North Dakota, Pennsylvania and Wisconsin
cy: Unol Daleithiau America - dim ond yn cynnwys Alabama, Alaska, Arizona, Arkansas, Connecticut, Delaware, Georgia, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maryland, Massachusetts, Missouri, Nebraska, New Hampshire, Gogledd Carolina, Gogledd Dakota, Pennsylvania a Wisconsin

source: Do you plan to remain married after you receive your Gender Recognition Certificate?
cy: Ydych chi’n bwriadu aros yn briod ar ôl cael eich Tystysgrif Cydnabod Rhywedd?

source: Do you plan to remain in your civil partnership after you receive your Gender Recognition Certificate?
cy: Ydych chi'n bwriadu aros yn eich partneriaeth sifil ar ôl i chi gael eich Tystysgrif Cydnabod Rhywedd?

source: We’ve resent you a security code. This can take a few minutes to arrive
cy: Rydym wedi ail anfon cod diogelwch atoch. Gall gymryd ychydig o funudau i gyrraedd

source: Select if you have ever changed your name to reflect your gender
cy: Dewiswch os ydych chi erioed wedi newid eich enw i adlewyrchu eich rhywedd

source: Select if you are currently married or in a civil partnership
cy: Dewiswch os ydych chi'n briod neu mewn partneriaeth sifil ar hyn o bryd

source: Select if you have ever been married or in a civil partnership where your spouse or partner died
cy: Dewiswch os ydych chi erioed wedi bod yn briod neu mewn partneriaeth sifil pan fu farw eich priod neu'ch partner

source: Select if you have ever been married or in a civil partnership that has ended
cy: Dewiswch os ydych chi erioed wedi bod yn briod neu mewn partneriaeth sifil sydd wedi dod i ben

source: Select if you have received gender recognition in one of these countries or territories
cy: Dewiswch os ydych chi wedi cael cydnabyddiaeth rhywedd yn un o'r gwledydd neu'r tiriogaethau hyn

source: Select if you plan to remain married after receiving your Gender Recognition Certificate
cy: Dewiswch os ydych chi’n bwriadu aros yn briod ar ôl cael eich Tystysgrif Cydnabod Rhywedd

source: Enter your email address
cy: Nodwch eich cyfeiriad e-bost

source: Enter a valid email address
cy: Nodwch gyfeiriad e-bost dilys

source: Enter a security code
cy: Nodwch god diogelwch

source: Enter the security code that we emailed you
cy: Nodwch y cod diogelwch y gwnaethom anfon atoch trwy e-bost

source: Select if you have already started an application
cy: Dewiswch a ydych eisoes wedi dechrau cais

source: Enter a reference number
cy: Nodwch gyfeirnod

source: Enter a valid reference number
cy: Nodwch gyfeirnod dilys

source: Select if you have ever been issued a Gender Recognition Certificate
cy: Dewiswch a roddwyd Tystysgrif Cydnabod Rhywedd ichi erioed

source: You must consent to the General Register Office contacting you
cy: Rhaid i chi roi caniatâd i’r Swyddfa Gofrestru Gyffredinol gysylltu â chi

source: Select if you have official documentation
cy: Dewiswch a oes gennych ddogfennaeth swyddogol

source: Enter a day
cy: Nodwch ddiwrnod

source: Enter a day as a number between 1 and 31
cy: Nodwch ddiwrnod fel rhif rhwng 1 ac 31

source: Enter a month
cy: Nodwch fis

source: Enter a month as a number between 1 and 12
cy: Nodwch fis fel rhif rhwng 1 a 12

source: Enter a year
cy: Nodwch flwyddyn

source: Enter a valid year
cy: Nodwch flwyddyn ddilys

source: Enter a valid date
cy: Nodwch ddyddiad dilys

source: Enter a year as a 4-digit number, like 2000
cy: Nodwch flwyddyn fel rhif 4 digid, fel 2000

source: Enter a date within the last 100 years
cy: Nodwch ddyddiad o fewn y 100 diwethaf

source: Enter a date in the past
cy: Nodwch ddyddiad yn y gorffennol

source: Enter a date in the future
cy: Nodwch ddyddiad yn y dyfodol

source: Enter a date at least 2 years before your application
cy: Nodwch ddyddiad o leiaf 2 o flynyddoedd cyn eich cais

source: Enter a date that does not precede your transition date
cy: Nodwch ddyddiad nad yw cyn dyddiad eich trawsnewidiad

source: 'From' date is in the past
cy: 'Mae'r 'o ddyddiad' yn y gorffennol

source: 'To' date is in the past
cy: 'Mae'r 'dyddiad diwedd' yn y gorffennol'

source: 'From' date is after the 'To' date
cy: 'Mae'r 'o ddyddiad' yw ar ôl mae'r 'dyddiad diwedd

source: Enter your address
cy: Nodwch eich cyfeiriad

source: Enter your town or city
cy: Nodwch eich tref neu ddinas

source: Enter a valid address line one
cy: Nodwch gyfeiriad llinell un dilys

source: Enter a valid address line two
cy: Nodwch gyfeiriad llinell dau dilys

source: Enter a valid town
cy: Nodwch dref ddilys

source: Enter your postcode
cy: Nodwch eich cod post

source: Enter a valid postcode
cy: Nodwch god post dilys

source: Enter your phone number
cy: Nodwch eich rhif ffôn

source: Enter a valid phone number
cy: Nodwch rif ffôn dilys

source: Enter your National Insurance number
cy: Nodwch eich rhif Yswiriant Gwladol

source: Enter a valid National Insurance number
cy: Nodwch rif Yswiriant Gwladol dilys

source: You need to be at least 18 years old to apply
cy: Mae angen i chi fod yn 18 oed o leiaf i wneud cais

source: You need to be less than 110 years old to apply
cy: Mae angen i chi fod yn iau na 110 oed i wneud cais

source: Your date of birth must be before your transition date and statutory declaration date
cy: Rhaid i’ch dyddiad geni fod cyn dyddiad eich trawsnewidiad a dyddiad eich datganiad statudol

source: The selected file is empty. Check that the file you are uploading has the content you expect
cy: Mae’r ffeil a ddewiswyd yn wag. Gwiriwch fod gan y ffeil rydych chi’n ei huwchlwytho y cynnwys rydych chi’n ei ddisgwyl

source: The selected file must be smaller than 10MB
cy: Rhaid i’r ffeil a ddewiswyd gennych fod yn llai na 10MB

source: Unable to communicate with virus scanner
cy: Methu cyfathrebu â sganiwr feirws

source: The selected file contains a virus
cy: Mae’r ffeil a ddewiswyd yn cynnwys feirws

source: Enter a valid 'Help with fees' reference number
cy: Nodwch gyfeirnod ‘Help i Dalu Ffioedd’ dilys

# BIRTH_DETS_ADOPTED
source: Yes
cy: Do

# BIRTH_DETS_ADOPTED
source: No
cy: Naddo

# BIRTH_DETS_FORCES
source: Yes
cy: Oedd

# BIRTH_DETS_FORCES
source: No
cy: Nac oedd

source: Enter your first name, as originally registered on your birth or adoption certificate
cy: Nodwch eich enw cyntaf, fel y’i cofrestrwyd yn wreiddiol ar eich tystysgrif geni neu dystysgrif mabwysiadu

source: Enter your last name, as originally registered on your birth or adoption certificate
cy: Nodwch eich cyfenw, fel y’i cofrestrwyd yn wreiddiol ar eich tystysgrif geni neu dystysgrif mabwysiadu

source: Select if your birth was registered in the UK
cy: Dewiswch os cafodd eich genedigaeth ei chofrestru yn y DU

source: Enter your country of birth
cy: Nodwch eich gwlad enedigol

source: Enter your town or city of birth
cy: Nodwch eich tref neu ddinas enedigol

source: Enter your mother's first name
cy: Nodwch enw cyntaf eich mam

source: Enter your mother's last name
cy: Nodwch gyfenw eich mam

source: Enter your mother's maiden name
cy: Nodwch enw cyn priodi eich mam

source: Select if your father's name is listed on the certificate
cy: Dewiswch os yw enw eich tad wedi’i nodi ar y dystysgrif

source: Enter your father's first name
cy: Nodwch enw cyntaf eich tad

source: Enter your father's last name
cy: Nodwch gyfenw eich tad

source: Select if you were you adopted
cy: Dewiswch os cawsoch eich mabwysiadu

source: Select if you were adopted in the United Kingdom
cy: Dewiswch os cawsoch eich mabwysiadu yn y Deyrnas Unedig

source: Select if your birth was registered by a Forces registering service, or with a British Consul or High Commission, or under Merchant Shipping or Civil Aviation provisions
cy: Dewiswch os cafodd eich genedigaeth ei chofrestru gan wasanaeth cofrestru’r Lluoedd, neu gan Gonswl Prydeinig neu Uchel Gomisiwn, neu dan ddarpariaethau Llongau Masnach neu Hedfan Sifil

source: Statutory declaration for applicants who are married
cy: Datganiad statudol ar gyfer ceiswyr sy’n briod

source: Statutory declaration for applicants who are in a civil partnership
cy: Datganiad statudol ar gyfer ceiswyr sydd mewn partneriaeth sifil

source: Your spouse’s statutory declaration
cy: Datganiad statudol eich priod

source: Your civil partner’s statutory declaration
cy: Datganiad statudol eich partner sifil

source: If you intend to remain married, your spouse needs to fill in and sign a
cy: Os ydych yn bwriadu aros yn briod, mae angen i’ch priod lenwi a llofnodi

source: If you are currently married and your spouse does not provide a statutory declaration of consent, or you do not plan to stay married, then you can still apply for a Gender Recognition Certificate without it, but you will be given an Interim Gender Recognition Certificate.
cy: Os ydych chi’n briod ar hyn o bryd ac nid yw’ch priod yn darparu datganiad statudol o gydsyniad, neu os nad ydych chi’n bwriadu aros yn briod, yna gallwch barhau i wneud cais am Dystysgrif Cydnabod Rhywedd hebddo, ond rhoddir Tystysgrif Cydnabod Rhywedd Interim i chi.

source: This can be used to end your marriage after which you’ll receive a full certificate
cy: Gallwch ddefnyddio’r dystysgrif hon i ddod â’ch priodas i ben ac yna fe gewch dystysgrif lawn

source: If you intend to remain in a civil partnership, your civil partner needs to fill in and sign a
cy: Os ydych yn bwriadu aros mewn partneriaeth sifil, mae angen i'ch partner sifil lenwi a llofnodi

source: If you are currently in a civil partnership and your civil partner does not provide a statutory declaration of consent, or you do not plan to stay in a civil partnership, then you can still apply for a Gender Recognition Certificate without it, but you will be given an Interim Gender Recognition Certificate.
cy: Os ydych mewn partneriaeth sifil ar hyn o bryd ac nad yw'ch partner sifil yn darparu datganiad statudol o gydsyniad, neu os nad ydych yn bwriadu aros mewn partneriaeth sifil, yna gallwch barhau i wneud cais am Dystysgrif Cydnabod Rhywedd hebddo, ond rhoddir Tystysgrif Cydnabod Rhywedd Dros Dro i chi.

source: This can be used to end your civil partnership after which you’ll receive a full certificate
cy: Gellir defnyddio hyn i ddod â'ch partneriaeth sifil i ben ac ar ôl hynny byddwch yn derbyn tystysgrif lawn

source: Your marriage certificate
cy: Eich tystysgrif priodas

source: Your civil partnership certificate
cy: Eich tystysgrif partneriaeth sifil

source: Upload a scan or good quality photograph of your marriage certificate
cy: Uwchlwythwch sgan neu lun o ansawdd da o’ch tystysgrif priodas

source: Upload a scan or good quality photograph of your civil partnership certificate
cy: Llwythwch sgan neu lun o ansawdd da o'ch tystysgrif partneriaeth sifil

# FEEDBACK
source: Yes
cy: Oedd

# FEEDBACK
source: No
cy: Nac oedd

# FEEDBACK_DOC_CHECKER
source: Yes
cy: Do

# FEEDBACK_DOC_CHECKER
source: No
cy: Naddo

source: Very easy
cy: Hawdd iawn

source: Easy
cy: Hawdd

source: Neither easy nor difficult
cy: Ddim yn hawdd nac yn anodd

source: Difficult
cy: Anodd

source: Very difficult
cy: Anodd iawn

source: I couldn't complete my application
cy: Nid oeddwn yn gallu cwblhau fy nghais

source: Select how easy it was to complete your application
cy: Dewiswch pa mor hawdd ydoedd i gwblhau eich cais

source: Select if you found any of the questions difficult to answer
cy: Dewiswch os oedd unrhyw un o’r cwestiynau yn anodd i’w hateb

source: Select if you needed to call the admin team for help with your application
cy: Dewiswch os oedd angen i chi ffonio’r tîm gweinyddol i gael help gyda’ch cais

source: Select if you used the tool to check which documents you needed to submit with your application
cy: Dewiswch os wnaethoch chi ddefnyddio’r adnodd i wirio pa ddogfennau yr oedd angen i chi eu cyflwyno gyda’ch cais

source: If you are in a same-sex civil partnership and want
cy: Os ydych mewn partneriaeth sifil o’r un rhyw ac rydych eisiau

source: convert your civil partnership to a marriage (opens in a new tab)
cy: newid eich partneriaeth sifil yn briodas (yn agor mewn tab newydd)

source: , you must do that before you apply for a Gender Recognition Certificate.
cy: , mae’n rhaid i chi wneud hynny cyn i chi wneud cais am Dystysgrif Cydnabod Rhywedd.

source: If you intend to remain in a civil partnership, your civil partner needs to fill in a
cy: Os ydych yn bwriadu aros mewn partneriaeth sifil, mae angen i’ch partner sifil lenwi

source: If you intend to remain married, your spouse needs to fill in a
cy: Os ydych yn bwriadu parhau i fod yn briod, bydd angen i’ch priod lenwi

source: statutory declaration for civil partners (opens in a new tab)
cy: datganiad statudol ar gyfer partneriaid sifil (yn agor mewn tab newydd)

source: statutory declaration for spouses (opens in a new tab)
cy: datganiad statudol ar gyfer priod (yn agor mewn tab newydd)

source: , and sign it in front of someone authorised to administer oaths.
cy: , a’i lofnodi ym mhresenoldeb rhywun sydd wedi’i awdurdodi i weinyddu llwon.

source: Can you provide a statutory declaration from your civil partner?
cy: Allwch chi ddarparu datganiad statudol gan eich partner sifil?

source: Can you provide a statutory declaration from your spouse?
cy: Allwch chi ddarparu datganiad statudol gan eich priod?

source: Your civil partner's details
cy: Manylion eich partner sifil

source: Your spouse's details
cy: Manylion eich priod

source: We will contact them about what to do if they change their mind about staying in a civil partnership.
cy: Byddwn yn cysylltu â nhw i ddweud wrthynt beth allant wneud os byddant yn newid eu meddwl am aros mewn partneriaeth sifil.

source: We will contact them about what to do if they change their mind about staying married.
cy: Byddwn yn cysylltu â nhw i ddweud wrthynt beth allant wneud os byddant yn newid eu meddwl am aros yn briod.

source: We will also let them know how their pensions and benefits may be affected if you receive a Gender Recognition Certificate.
cy: Byddwn hefyd yn rhoi gwybod iddynt sut y gall hyn effeithio ar eu pensiynau a’u budd-daliadau os byddwch yn cael Tystysgrif Cydnabod Rhywedd.

source: Remain married
cy: Aros yn briod

source: Remain in your civil partnership
cy: Aros yn eich partneriaeth sifil

source: Spouse's name
cy: Enw’ch priod

source: Civil partner's name
cy: Enw’ch partner sifil

source: Spouse's postal address
cy: Cyfeiriad eich priod ar gyfer postio

source: Civil partner's postal address
cy: Cyfeiriad eich partner sifil ar gyfer postio

source: Can provide a declaration of consent from your spouse
cy: Gallu darparu datganiad o gydsyniad gan eich priod

source: Can provide a declaration of consent from your civil partner
cy: Gallu darparu datganiad o gydsyniad gan eich partner sifil

source: When you apply for a certificate, your civil partner needs to sign a document if you want to stay in a civil partnership.
cy: Pan fyddwch yn gwneud cais am dystysgrif, mae angen i'ch partner sifil lofnodi dogfen os ydych yn bwriadu aros mewn partneriaeth sifil.

source: If they do not sign the document, or you’re ending the civil partnership, you will get an ‘interim’ certificate if you continue with your application.
cy: Os na fyddant yn llofnodi’r ddogfen, neu os ydych yn dod â’ch partneriaeth sifil i ben, byddwch yn cael tystysgrif ‘interim’ os byddwch yn parhau â’ch cais.

source: You can only use the interim certificate to end your civil partnership.
cy: Gallwch ond defnyddio’r dystysgrif interim i ddod â’ch partneriaeth sifil i ben.

source: You will get a full certificate once you’re no longer in a civil partnership.
cy: Byddwch yn cael tystysgrif lawn pan na fyddwch yn partneriaeth sifil mwyach.

source: When you apply for a certificate, your spouse needs tosign a document if you want to stay married.
cy: Pan fyddwch yn gwneud cais am dystysgrif, mae angen i’ch priod lofnodi dogfen os ydych eisiau aros yn briod.

source: If they do not sign the document, or you’re ending the marriage, you will get an ‘interim’ certificate if you continue with your application.
cy: Os na fyddant yn llofnodi’r ddogfen, neu os ydych yn dod â’ch priodas i ben, byddwch yn cael tystysgrif ‘interim’ os byddwch yn parhau â’ch cais.

source: You can only use the interim certificate to end your marriage.
cy: Gallwch ond defnyddio’r dystysgrif interim i ddod â’ch priodas i ben.

source: You will get a full certificate once you’re no longer married.
cy: Byddwch yn cael tystysgrif lawn pan na fyddwch yn briod mwyach.

source: You have 6 months to apply for an annulment, divorce or dissolution from when you get your interim certificate.
cy: Mae gennych 6 mis i wneud cais am ddirymiad, ysgariad neu ddiddymiad o’r adeg pan fyddwch yn cael eich tystysgrif interim.

source: Select if you plan to remain married or in your civil partnership after receiving your Gender Recognition Certificate
cy: Dewiswch os ydych chi’n bwriadu aros yn briod neu mewn partneriaeth sifil ar ôl cael eich Tystysgrif Cydnabod Rhywedd

source: Select if you can provide a declaration of consent from your spouse or civil partner
cy: Dewiswch os ydych chi'n gallu darparu datganiad o gydsyniad gan eich priod neu bartner sifil

source: Enter your spouse or civil partner's title
cy: Nodwch deitl eich priod neu bartner sifil

source: Enter your spouse or civil partner's first name
cy: Nodwch enw cyntaf eich priod neu bartner sifil

source: Enter your spouse or civil partner's last name
cy: Nodwch gyfenw eich priod neu bartner sifil

source: Enter your spouse or civil partner's postal address
cy: Nodwch gyfeiriad post eich priod neu bartner sifil

source: Select if you were previously married or in a civil partnership, and your spouse or partner died
cy: Dewiswch os ydych chi wedi bod yn briod neu mewn partneriaeth sifil yn y gorffennol, a bu farw eich priod neu'ch partner

# CONTACT_HMRC
source: Yes
cy: Hoffwn

# CONTACT_HMRC
source: No
cy: Na hoffwn

source: Male
cy: Gwryw

source: Female
cy: Benyw

source: A single date
cy: Dyddiad unigol

source: A range of dates
cy: Ystod o ddyddiadau

source: No dates
cy: Dim dyddiadau

source: Email
cy: E-bost

source: Phone call
cy: Galwad ffôn

source: Enter your title
cy: Nodwch eich teitl

source: Enter your first name(s)
cy: Nodwch eich enw(au) cyntaf

source: Enter your last name
cy: Nodwch eich cyfenw

source: Select your affirmed gender
cy: Dewiswch eich rhywedd a gadarnhawyd

source: Select if you don't want us to contact you at any point in the next 6 months
cy: Dewiswch os nad ydych chi am i ni gysylltu â chi ar unrhyw adeg yn ystod y 6 mis nesaf

source: Select how would you like to be contacted
cy: Dewiswch sut hoffech chi inni gysylltu â chi

source: Select if you would like us to tell HMRC after you receive a Gender Recognition Certificate
cy: Dewiswch os hoffech chi i ni ddweud wrth HMRC ar ôl i chi gael eich Tystysgrif Cydnabod Rhywedd

source: No, I will pay now
cy: Nac ydw, mi wnaf dalu’r ffi nawr

source: Using the online service
cy: Defnyddio’r gwasanaeth ar-lein

source: Using the EX160 form
cy: Defnyddio’r ffurflen EX160

source: Online
cy: Ar-lein

source: Select if you are applying for help paying the fee
cy: Dewiswch os ydych chi’n gwneud cais am help i dalu’r ffi

source: Select how are you applying for help paying the fee
cy: Dewiswch sut ydych chi’n gwneud cais am help i dalu’r ffi

source: Enter your Help with Fees reference number
cy: Nodwch eich cyfeirnod Help i Dalu Ffioedd

source: You must certify that all information given in this application is correct and that you understand making a false application is an offence.
cy: Rhaid i chi ardystio bod yr holl wybodaeth a roddwyd yn y cais hwn yn gywir a'ch bod yn deall bod gwneud cais ffug yn drosedd.

source: Upload file
cy: Uwchlwytho ffeil

source: Save and continue
cy: Cadw a pharhau

source: Click on either the 'Upload file' button or 'Save and continue' button
cy: Cliciwch ar naill ai’r botwm ‘Uwchlwytho ffeil’ neu ‘Cadw a pharhau’

source: Select a JPG, BMP, PNG, TIF or PDF file smaller than 10MB
cy: Dewiswch ffeil JPG, BMP, PNG, TIF neu ffeil PDF sy'n llai na 10MB o ran maint

source: Apply for a Gender Recognition Certificate
cy: Gwneud cais am Dystysgrif Cydnabod Rhywedd

source: Success
cy: Llwyddiant

source: Email resent
cy: E-bost wedi'i ail anfon

source: Privacy policy
cy: Polisi Preifatrwydd

source: Accessibility statement
cy: Datganiad hygyrchedd

source: Cookies
cy: Cwis

source: Telephone
cy: Rhif ffôn

source: Monday to Friday, 9am to 5pm
cy: Dydd Llun i ddydd Iau 9am i 5pm, dydd Gwener 9am i 4.30pm

source: Find out about call charges (opens in a new tab)
cy: Rhagor o wybodaeth am gost galwadau (yn agor mewn tab newydd)

source: Enter security code
cy: Rhowch y cod diogelwch

source: We’ve sent a security code to
cy: Rydym wedi anfon cod diogelwch i

source: This can take a few minutes to arrive
cy: Gall gymryd ychydig o funudau i gyrraedd

source: If you do not get an email
cy: Os na fyddwch yn cael y neges e-bost

source: check your spam or junk folder
cy: gwiriwch eich ffolder spam neu sothach

source: check you have entered the correct email
cy: sicrhewch eich bod wedi rhoi y cyfeiriad e-bost cywir

source: If it's still not there, we can
cy: Os ydych dal heb gael y neges e-bost,

source: resend the email
cy: gallwn ei hanfon eto

source: Security code
cy: Cod diogelwch

source: Your application
cy: Eich cais

source: This is where you can provide your personal details and upload your documents
cy: Dyma lle gallwch ddarparu eich manylion personol ac uwchlwytho eich dogfennau

source: Your application is saved automatically as you progress
cy: Bydd eich cais yn cael ei gadw’n awtomatig wrth i chi ei gwblhau

source: You can
cy: Gallwch

source: save and exit
cy: gadw’ch cais

source: at any time and return to your application later
cy: ar unrhyw adeg a dychwelyd ato yn hwyrach ymlaen

source: You can upload most documents online, but you will need to post us your birth or adoption certificate
cy: Gallwch uwchlwytho’r rhan fwyaf o ddogfennau ar-lein, ond bydd angen i chi bostio’ch tystysgrif geni neu dystysgrif mabwysiadu atom

source: What you need to upload depends on the information you provide during your application
cy: Mae beth fydd angen i chi ei uwchlwytho yn dibynnu ar yr wybodaeth a ddarperir gennych yn ystod eich cais

source: Before you start
cy: Cyn i chi ddechrau

source: Confirmation
cy: Cadarnhau

source: Fill in your details
cy: Rhoi eich manylion

source: Your personal details
cy: Eich manylion personol
