Repository: ministryofjustice/grc-app
Catalog: grc/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: If you are sending documents by Royal Mail (including tracked, special delivery, signed for, and Parcelforce), send to:
cy: Os ydych yn defnyddio’r Post Brenhinol i anfon dogfennau (gan gynnwys y gwasanaeth olrhain, danfoniad arbennig, wedi arwyddo amdano, a Parcelforce), anfonwch nhw i:

source: If you are sending documents by courier (for example, DPD, Evri, Fedex), please contact us first (details below).
cy: Os ydych yn defnyddio gwasanaeth cludo (er enghraifft, DPD, Evri, Fedex), cysylltwch â ni yn gyntaf (manylion isod).

source: Do not send us any other documents unless we ask you to.
cy: Peidiwch ag anfon unrhyw ddogfennau eraill atom oni bai ein bod yn gofyn i chi wneud hynny.

source: What happens next with your application
cy: Beth fydd yn digwydd nesaf gyda’ch cais

source: Once you’ve sent your documents, your application will be reviewed by the Gender Recognition Panel.
cy: Unwaith y byddwch wedi anfon eich dogfennau atom, bydd eich cais yn cael ei adolygu gan y Panel Cydnabod Rhywedd.

source: This usually happens within 30 weeks of you applying.
cy: Gan amlaf bydd hyn yn digwydd o fewn 30 wythnos i chi wneud cais.

source: We will let you know if your application has any errors or missing documents, or if the Panel needs any more information.
cy: Byddwn yn gadael i chi wybod os bydd unrhyw gamgymeriadau yn eich cais neu ddogfennau ar goll, neu os bydd y Panel angen rhagor o wybodaeth.

source: We will ensure you have the time you need to provide any missing or additional information.
cy: Byddwn yn sicrhau eich bod yn cael yr amser sydd ei angen arnoch i ddarparu unrhyw wybodaeth sydd ar goll neu wybodaeth ychwanegol.

source: You will then be told if you will be issued with a Gender Recognition Certificate, and what you can do if your application has not been accepted.
cy: Yna fe ddywedir wrthych os byddwch yn cael Tystysgrif Cydnabod Rhywedd, a beth allwch wneud os na fydd eich cais wedi’i dderbyn.

source: If you need to contact us
cy: Os byddwch angen cysylltu â ni

source: Include your application reference number – we will send this to you by post when we have received your application.
cy: Bydd angen i chi gynnwys cyfeirnod eich cais - byddwn yn anfon hwn atoch drwy’r post pan fydd eich cais wedi ein cyrraedd.

source: If you need to contact us before you have received your application reference number, include your full name and postcode.
cy: Os byddwch angen cysylltu â ni cyn i chi gael cyfeirnod eich cais, dylech gynnwys eich enw llawn a’ch cod post.

source: Applying for help with the fee
cy: Gwneud cais am help i dalu’r ffi

source: apply online for help paying this fee (opens in a new tab)
cy: wneud cais ar-lein am help i dalu’r ffi hon (yn agor mewn tab newydd)

source: You can also download the EX160 form from that page and submit it with your application.
cy: Gallwch hefyd lawrlwytho ffurflen EX160 o’r dudalen honno a’i chyflwyno gyda’ch cais.

source: How are you applying for help paying the fee?
cy: Sut ydych chi’n gwneud cais am help i dalu’r ffi?

source: This will appear on your Gender Recognition Certificate
cy: Bydd hwn yn ymddangos ar eich Tystysgrif Cydnabod Rhywedd

source: What is your Help with Fees reference number?
cy: Beth yw eich cyfeirnod Help i Dalu Ffioedd?

source: For example, HWF-123-456
cy: Er enghraifft, HWF-123-456

source: Payment
cy: Talu

source: Applying for a Gender Recognition Certificate costs &pound;6.
cy: Mae gwneud cais am Dystysgrif Cydnabod Rhywedd yn costio &pound;6.

source: Are you applying for help paying the fee?
cy: Ydych chi’n gwneud cais am help i dalu’r ffi?

source: If you select yes, your application for a Gender Recognition Certificate will only be reviewed if your application for help paying the fee is accepted.
cy: Os byddwch yn dewis ‘Ydw’, bydd eich cais am Dystysgrif Cydnabod Rhywedd ond yn cael ei adolygu os bydd eich cais am help i dalu’r ffi yn cael ei dderbyn.

source: Uploaded files
cy: Ffeiliau sydd wedi cael eu huwchlwytho

source: Remove file
cy: Dileu ffeil

source: Upload files
cy: Uwchlwytho ffeiliau

source: The files must be a JPG, BMP, PNG, TIF or PDF and be smaller than 10MB
cy: Rhaid i’r ffeiliau fod ar ffurf JPG, BMP, PNG, TIF neu PDF a bod yn llai na 10MB o ran maint

source: Once you have uploaded all your files, click the "Save and continue" button
cy: Unwaith y byddwch wedi uwchlwytho eich holl ffeiliau, cliciwch y botwm "Cadw a pharhau"

source: You must upload a scan or good quality photograph of your documents.
cy: Rhaid i chi uchlwytho sgan neu lun o ansawdd da o'ch dogfennau.

source: If the document is longer than one page, you must upload every page.
cy: Os yw’r ddogfen yn hirach nag un tudalen, mae’n rhaid i chi uwchlwytho pob tudalen.

source: We will only accept clear images of full pages.
cy: Byddwn ond yn derbyn delweddau clir o dudalennau llawn.

source: If you take a photograph, please make sure all 4 corners of each page are visible.
cy: Os byddwch yn tynnu llun, gwnewch yn siŵr bod pob 4 cornel o bob tudalen yn weladwy.

source: We process and protect all documents you upload in accordance with our
cy: Rydym yn prosesu ac yn diogelu pob dogfen rydych chi'n ei huwchlwytho yn unol â'n

source: privacy policy (opens in a new tab)
cy: polisi preifatrwydd (yn agor mewn tab newydd)

source: Upload evidence of living in your gender
cy: Uwchlwytho tystiolaeth o fyw yn eich rhywedd

source: This is where you can upload evidence to show you’ve been living in your affirmed gender for the last 2 years.
cy: Dyma lle y gallwch uwchlwytho tystiolaeth i ddangos eich bod wedi bod yn byw yn eich rhywedd a gadarnhawyd am y 2 flynedd diwethaf.

source: For example, if you submit your application today, you will need evidence from
cy: Er enghraifft, os byddwch yn cyflwyno eich cais heddiw, byddwch angen tystiolaeth o

source: Find out more about the
cy: Rhagor o wybodaeth am

source: evidence of living in your gender you need (opens in new tab)
cy: y dystiolaeth o fyw yn eich rhywedd sydd ei hangen arnoch (yn agor mewn tab newydd)

source: Do not upload more than 4 pieces of evidence for each year.
cy: Peidiwch ag uwchlwytho mwy na 4 darn o dystiolaeth ar gyfer pob blwyddyn.

source: Do not upload a document you have already submitted, such as a medical report.
cy: Peidiwch ag uwchlwytho dogfen rydych eisoes wedi’i chyflwyno, megis adroddiad meddygol.

source: Upload marriage or civil partnership documents
cy: Uwchlwytho dogfennau priodas neu bartneriaeth sifil

source: This is where you can upload copies of your marriage or civil partnership documents.
cy: Dyma lle y gallwch uwchlwytho copïau o’ch dogfennau priodas neu bartneriaeth sifil.

source: documents you need if you’ve ever been married or in a civil partnership (opens in new tab)
cy: y dogfennau sydd ei hangen arnoch os ydych erioed wedi bod yn briod neu mewn partneriaeth sifil (yn agor mewn tab newydd)

source: Upload your medical reports
cy: Uwchlwythwch eich adroddiadau meddygol

source: This is where you can upload your 2 medical reports.
cy: Dyma lle y gallwch uwchlwytho eich 2 adroddiad meddygol.

source: medical reports you need (opens in new tab)
cy: yr adroddiadau meddygol sydd eu hangen arnoch (yn agor mewn tab newydd)

source: You must upload a scan or good quality photograph of the whole medical report.
cy: Mae’n rhaid i chi uwchlwytho sgan neu lun o ansawdd da o’r adroddiad meddygol cyfan.

source: If the report is longer than one page, you must upload every page.
cy: Os yw’r adroddiad yn hirach nag un tudalen, mae’n rhaid i chi uwchlwytho pob tudalen.

source: Please upload the files in page order if you can.
cy: Uwchlwythwch y ffeiliau yn eu trefn os yw’n bosibl.

source: Upload name change documents
cy: Uwchlwytho dogfennau newid enw

source: This is where you can upload copies of all documents that show when you have changed your name to reflect your gender.
cy: Dyma lle y gallwch uwchlwytho copïau o’r holl ddogfennau sy’n dangos eich bod wedi newid eich enw i adlewyrchu eich rhywedd.

source: You can upload:
cy: Gallwch uwchlwytho:

source: Upload overseas gender recognition certificate documents
cy: Uwchlwytho dogfennau tystysgrif cydnabod rhywedd tramor

source: This is where you can upload copies of your overseas gender recognition certificate documents.
cy: Dyma lle gallwch uwchlwytho copïau o’ch dogfennau tystysgrif cydnabod rhywedd tramor.

source: Find out more about documents you can submit
cy: Rhagor o wybodaeth am ddogfennau y gallwch eu cyflwyno

source: if you’re on the overseas route (opens in new tab)
cy: os ydych ar y llwybr tramor (yn agor mewn tab newydd)

source: Upload statutory declarations documents
cy: Uwchlwytho dogfennau datganiadau statudol

source: This is where you can upload copies of all required statutory declarations.
cy: Dyma ble y gallwch uwchlwytho copïau o’r holl ddatganiadau statudol gofynnol.

source: You must upload either:
cy: Mae’n rhaid i chi uwchlwytho naill ai:

source: a statutory declaration for single applicants
cy: datganiad statudol ar gyfer ceiswyr sengl

source: a statutory declaration for applicants who are married or in a civil partnership
cy: datganiad statudol ar gyfer ceiswyr sy’n briod neu mewn partneriaeth sifil

source: If you fill out the statutory declaration for applicants who are married or in a civil partnership and you intend to stay in that marriage or civil partnership after you receive a certificate, you must also upload a statutory declaration signed by your spouse or civil partner.
cy: Os ydych chi’n llenwi’r datganiad statudol ar gyfer ceiswyr sy’n briod neu mewn partneriaeth sifil a’ch bod yn bwriadu aros yn y briodas neu’r bartneriaeth sifil ar ôl i chi gael tystysgrif, mae’n rhaid i chi hefyd uwchlwytho datganiad statudol wedi’i lofnodi gan eich priod neu bartner sifil.

source: Follow the
cy: Dilynwch y

source: guidance on statutory declarations (opens in a new tab)
cy: cyfarwyddyd ar ddatganiadau statudol (yn agor mewn tab newydd)

source: to find out which declaration is right for you and who can act as a witness when you sign your declaration.
cy: i ganfod pa ddatganiad sy’n briodol i’ch sefyllfa chi a phwy all weithredu fel tyst pan fyddwch yn llofnodi eich datganiad.

source: Start or return to an application
cy: Dechrau cais newydd neu ddychwelyd i gais

source: You’ll need a <a href="https://www.gov.uk/using-your-gov-uk-one-login/services" target="_blank" class="govuk-link">One Login GOV.UK</a> to start a new application or return to your application that was started with GOV.UK One Login.
cy: Bydd arnoch angen cyfrif <a href="https://www.gov.uk/apply-gender-recognition-certificate" target="_blank" class="govuk-link">GOV.UK One Login</a> er mwyn dechrau cais newydd neu ddychwelyd i’ch cais a ddechreuwyd gyda One Login GOV.UK.

source: If this is your first time using this service, we will give you a reference number. You will need this if you return to your application.
cy: Os ydych chi’n dychwelyd i’ch cais na ddechreuwyd gyda One Login GOV.UK, bydd angen i chi hefyd nodi’ch cyfeiriad e-bost a’ch cod diogelwch.

source: Before you start a new application, make sure you have read the guidance on <a href='https://www.gov.uk/apply-gender-recognition-certificate' target='_blank' class='govuk-link'>applying for a Gender Recognition Certificate (opens in a new tab)</a>.
cy: Cyn i chi ddechrau gwnewch yn siŵr eich bod wedi darllen y cyfarwyddyd ar <a href='https://www.gov.uk/apply-gender-recognition-certificate' target='_blank' class='govuk-link'>wneud cais am Dystysgrif Cydnabod Rhywedd (yn agor mewn tab newydd)</a>.

source: Start a new application
cy: Dechrau cais newydd

source: Return to your existing application
cy: Dychwelyd i’ch cais presennol

source: I have my reference number
cy: Mae gennyf fy nghyfeirnod

source: I have lost my reference number
cy: Rwyf wedi colli fy nghyfeirnod

source: There is a mismatch with your application reference number and GOV.UK One Login email address
cy: Nid yw cyfeirnod eich cais a’ch cyfeiriad e-bost One Login GOV.UK yn cyfateb i’w gilydd

source: Your application reference number has not been validated
cy: Nid yw cyfeirnod eich cais wedi’i ddilysu

source: Application reference number
cy: Cyfeirnod y cais

source: You need to provide an email address to continue your application so we can save your progress and you can exit and return to your application later.
cy: Mae angen i chi ddarparu cyfeiriad e-bost i barhau â'ch cais fel y gallwn arbed eich cynnydd a gallwch adael a dychwelyd i'ch cais yn hwyrach ymlaen.

source: Do you have proof of your identity?
cy: A oes gennych chi dystiolaeth o bwy ydych chi?

source: You can confirm your identity online using any valid photo ID such as a passport or photocard driving license. This can be in your affirmed gender or gender at birth.
cy: Gallwch gadarnhau eich hunaniaeth ar-lein drwy ddefnyddio llun adnabod dilys fel pasbort neu drwydded yrru cerdyn-llun. Gall hyn fod yn rhywedd a gadarnhawyd gennych neu eich rhywedd adeg eich geni.

source: If you don’t have a photo ID, there may be other ways you can provide your identity online using this service, for example by answering security questions.
cy: Os nad oes gennych chi ddogfen adnabod â llun, efallai y gallwch brofi pwy ydych chi ar-lein mewn rhyw ffordd arall gan ddefnyddio’r gwasanaeth hwn, er enghraifft drwy ateb cwestiynau diogelwch.

source: Yes, I can confirm my identity online
cy: Gallaf, mi allaf gadarnhau fy hunaniaeth ar-lein

source: No, I cannot confirm my identity online
cy: Na allaf, ni allaf gadarnhau fy hunaniaeth ar-lein

source: If you are unable to confirm your identity online or have not previously confirmed your identity online using GOV.UK OneLogin, your application may take longer to process as this will need to be done once we have received your application.
cy: Os nad ydych yn gallu cadarnhau eich hunaniaeth ar-lein neu os nad ydych wedi cadarnhau eich hunaniaeth ar-lein o'r blaen gan ddefnyddio GOV.UK One Login, efallai y bydd eich cais yn cymryd mwy o amser i'w brosesu gan y bydd angen gwneud hyn ar ôl i ni dderbyn eich cais.

source: Upload your birth or adoption certificate
cy: Uwchlwythwch eich tystysgrif geni neu fabwysiadu

source: This is where you can upload the original or certified copy of your birth or adoption certificate.
cy: Dyma ble gallwch uwchlwytho’r copi gwreiddiol neu gopi ardystiedig o’ch tystysgrif geni neu fabwysiadu.

source: Please upload a scan or good quality photograph of the certificate.
cy: Uwchlwythwch sgan neu lun o ansawdd da o’r dystysgrif.

source: Your email address has not been validated
cy: Nid yw eich cyfeiriad e-bost wedi’i ddilysu
