Repository: ministryofjustice/grc-app
Catalog: grc/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Your birth registration information
cy: Gwybodaeth am gofrestru eich genedigaeth

source: Marriage or civil partnership details
cy: Manylion eich priodas neu bartneriaeth sifil

source: Upload your documents
cy: Uwchlwytho eich dogfennau

source: Your medical reports
cy: Eich adroddiadau meddygol

source: Evidence of living in your gender
cy: Tystiolaeth o fyw yn eich rhywedd

source: Name change documents
cy: Dogfennau newid enw

source: Marriage and civil partnership documents
cy: Dogfennau priodas a phartneriaeth sifil

source: Overseas certificate documents
cy: Dogfennau Tystysgrif o Dramor

source: Statutory declarations
cy: Datganiadau statudol

source: Apply
cy: Gwneud cais

source: Once you have completed the other sections you can submit your application
cy: Unwaith y byddwch wedi cwblhau’r adrannau eraill gallwch gyflwyno eich cais

source: Submit and pay
cy: Cyflwyno a thalu

source: Returning to your application
cy: Dychwelyd i’ch cais

source: Exit and return later
cy: Gadael a dychwelyd yn hwyrach ymlaen

source: Were you adopted in the United Kingdom?
cy: A gawsoch chi eich mabwysiadu yn y Deyrnas Unedig?

source: This information will help us find your original birth record.
cy: Bydd yr wybodaeth hon yn ein helpu i ddod o hyd i’ch cofnod geni gwreiddiol.

source: or
cy: neu

source: Were you adopted?
cy: A gawsoch chi eich mabwysiadu?

source: Check your answers: Birth registration details
cy: Gwiriwch eich atebion: Manylion Cofrestru Genedigaeth

source: Check your answers:
cy: Gwiriwch eich atebion:

source: Birth registration details
cy: Manylion Cofrestru Genedigaeth

source: Birth name
cy: Enw adeg geni

source: Date of birth
cy: Dyddiad geni

source: Birth registered in UK
cy: Genedigaeth a gofrestrwyd yn y DU

source: Town or city of birth
cy: Tref neu ddinas geni

source: Mother's name
cy: Enw’r fam

source: Father's name listed
cy: Enw’r tad a restrwyd

source: Father's name
cy: Enw’r tad

source: Adopted
cy: Mabwysiadwyd

source: Adopted in UK
cy: Mabwysiadwyd yn y DU

source: Forces registering service, British Consul or High Commission, or under Merchant Shipping or Civil Aviation provisions
cy: Gwasanaeth cofrestru’r Lluoedd, Conswl Prydeinig neu Uchel Gomisiwn, neu dan ddarpariaethau Llongau Masnach neu Hedfan Sifil

source: Registered birth country
cy: Gwlad enedigol gofrestredig

source: What country was your birth registered in?
cy: Ym mha wlad cafodd eich genedigaeth ei chofrestru?

source: What is your date of birth?
cy: Beth yw eich dyddiad geni?

source: What is the date of birth on your birth or adoption certificate?
cy: Beth yw’r dyddiad geni ar eich tystysgrif geni neu dystysgrif mabwysiadu?

source: Enter the year in full - for example, 1987
cy: Rhowch y flwyddyn yn llawn, er enghraifft 1987

source: Day
cy: Diwrnod

source: Month
cy: Mis

source: Year
cy: Blwyddyn

source: Is your father's name listed on the certificate?
cy: A yw enw eich tad wedi'i nodi ar y dystysgrif?

source: What is your father's name?
cy: Beth yw enw eich tad?

source: What is your father's name as listed on your birth or adoption certificate?
cy: Beth yw enw eich tad fel y nodir ar eich tystysgrif geni neu dystysgrif mabwysiadu?

source: First name
cy: Enw cyntaf

source: Last name
cy: Cyfenw

source: Was your birth registered by a Forces registering service?
cy: A oedd eich genedigaeth wedi’i chofrestru gan wasanaeth cofrestru y Lluoedd?

source: Was your birth registered by a Forces registering service, or with a British Consul or High Commission, or under Merchant Shipping or Civil Aviation provisions?
cy: A oedd eich genedigaeth wedi’i chofrestru gan wasanaeth cofrestru y Lluoedd, neu gyda Chonswl Prydeinig neu Uwch Gomisiwn, neu dan ddarpariaethau Llongau Masnach neu Hedfan Sifil?

source: This information will help us locate your original birth record.
cy: Bydd yr wybodaeth hon yn ein helpu i ddod o hyd i’ch cofnod geni gwreiddiol.

source: What is your mother’s name?
cy: Beth yw enw eich mam?

source: What is your first parent's name as listed on your birth or adoption certificate?
cy: Beth yw enw eich rhiant cyntaf fel y’i nodwyd ar eich tystysgrif geni neu fabwysiadu?mabwysiadu?

source: Maiden name (her surname at birth - include even if same as last name)
cy: Enw cyn priodi (ei chyfenw pan gafodd ei geni - dylech ei roi hyd yn oed os yw’r un fath â’r enw olaf)

source: What name was originally registered on your birth or adoption certificate?
cy: Pa enw oedd wedi’i gofrestru’n wreiddiol ar eich tystysgrif geni neu’ch tystysgrif mabwysiadu?

source: Middle names (only required if you have middle names)
cy: Enwau canol (dim ond os oes gennych enwau canol)

source: If there is no last name on the certificate, use the last name of a parent or adoptive parent.
cy: Os nad oes yna enw olaf ar y dystysgrif, defnyddiwch enw olaf rhiant neu riant mabwysiadol.

source: What is the town or city of birth on your birth or adoption certificate?
cy: Beth yw’r dref neu’r ddinas a nodir ar eich tystysgrif geni neu dystysgrif mabwysiadu?

source: Was your birth registered in the UK?
cy: A gafodd eich genedigaeth ei chofrestru yn y DU?

source: Select yes if you have a UK birth or adoption certificate or your birth was registered by the Forces registering service, a British Consul or High Commission, or under Merchant Shipping or Civil Aviation provisions.
cy: Dewiswch ‘Oes’ os oes gennych dystysgrif geni neu dystysgrif mabwysiadu y DU neu os cafodd eich genedigaeth ei chofrestru gan wasanaeth cofrestru’r Lluoedd, Conswl Prydeinig neu Uchel Gomisiwn, neu dan ddarpariaethau Llongau Masnach neu Hedfan Sifil.

source: Page not found
cy: Ni ellir dod o hyd i’r dudalen

source: If you typed the web address, check it is correct.
cy: Os bu ichi deipio cyfeiriad y wefan, gwiriwch ei fod yn gywir.

source: If you pasted the web address, check you copied the entire address.
cy: Os bu ichi ludo cyfeiriad y wefan, gwiriwch eich bod wedi copïo’r cyfeiriad cyfan.

source: If the web address is correct or you selected a link or button, contact the admin team if you need help with your application.
cy: Os yw cyfeiriad y wefan yn gywir, neu os gwnaethoch glicio ar ddolen neu fotwm, cysylltwch â'r tîm gweinyddol os oes angen help arnoch gyda'ch cais.

source: Sorry, the service is unavailable
cy: Yn anffodus, nid yw’r gwasanaeth ar gael

source: The rate limit for this page has been exceeded. Please try again later.
cy: Aethpwyd y tu hwnt i derfyn y gyfradd ar gyfer y dudalen hon. Rhowch gynnig arall arni hwyrach ymlaen.

source: Contact the admin team if you need help with your application.
cy: Cysylltwch â'r tîm gweinyddol os oes angen help arnoch gyda'ch cais.

source: Sorry, there is a problem with the service
cy: Mae'n ddrwg gennym, mae problem gyda'r gwasanaeth

source: Please try again later.
cy: Rhowch gynnig arall arni hwyrach ymlaen.

source: We have saved your answers. They will be available for 6 months.
cy: Rydym wedi cadw eich atebion. Cedwir yr wybodaeth am 6 mis.

source: Are you currently married or in a civil partnership?
cy: Ydych chi'n briod neu mewn partneriaeth sifil ar hyn o bryd?

source: Select your current legal status, even if you are planning to end your marriage or civil partnership.
cy: Dewiswch eich statws cyfreithiol cyfredol, hyd yn oed os ydych yn bwriadu dod â'ch priodas neu bartneriaeth sifil i ben.

source: Check documents needed to apply for a Gender Recognition Certificate
cy: Gwirio dogfennau sydd eu hangen i wneud cais am Dystysgrif Cydnabod Rhywedd

source: What is your email address?
cy: Beth yw eich cyfeiriad e-bost?

source: If you would like to receive your list of documents by email, enter your email address here
cy: Os hoffech gael eich rhestr o ddogfennau drwy e-bost, nodwch eich cyfeiriad e-bost yma

source: Continue
cy: Parhau

source: Return to your documents list
cy: Dychwelyd at eich rhestr o ddogfennau

source: Email sent
cy: E-bost wedi’i anfon

source: You should shortly receive an email with the required documents for applying for a gender recognition certification.
cy: Dylech gael neges e-bost yn fuan gyda’r dogfennau angenrheidiol ar gyfer gwneud cais am ardystiad cydnabod rhywedd.

source: Once you have your documents ready you can
cy: Unwaith y bydd eich dogfennau'n barod

source: apply for a certificate
cy: gallwch wneud cais am dystysgrif

source: Gender recognition outside of the UK
cy: Cydnabod rhywedd y tu allan i'r DU

source: Some people may have already received gender recognition outside of the UK.
cy: Efallai bod rhai pobl eisoes wedi derbyn cydnabyddiaeth rhywedd y tu allan i'r DU.

source: The documents you need to provide are different if you have received gender recognition in a country or territory from this list:
cy: Mae'r dogfennau y mae angen i chi eu darparu yn wahanol os ydych wedi cael cydnabyddiaeth rhywedd mewn gwlad neu diriogaeth o'r rhestr hon:

source: Have you received gender recognition in one of these countries or territories?
cy: Ydych chi wedi cael cydnabyddiaeth rhywedd yn un o'r gwledydd neu'r tiriogaethau hyn?

source: Have you ever been in a marriage or civil partnership where your spouse or partner died?
cy: Ydych chi erioed wedi bod mewn priodas neu bartneriaeth sifil lle bu farw eich priod neu'ch partner?

source: Have you ever changed your name to reflect your gender?
cy: Ydych chi erioed wedi newid eich enw i adlewyrchu eich rhywedd?

source: If you have ever changed your name to reflect your gender
cy: Os ydych chi erioed wedi newid eich enw i adlewyrchu eich rhywedd

source: You will need to send us documents that show this
cy: Bydd angen i chi anfon dogfennau atom sy'n dangos hynny

source: If you have changed your name more than once, we will need to see documents for each instance
cy: Os ydych wedi newid eich enw fwy nag unwaith, bydd angen i ni weld dogfennau ar gyfer pob achos

source: We ask for this so we can match your birth records after you receive a Gender Recognition Certificate
cy: Gofynnwn am hyn fel y gallwn eu cyfateb i'ch cofnodion geni ar ôl i chi gael Tystysgrif Cydnabod Rhywedd

source: These documents are likely to be:
cy: Mae'r dogfennau hyn yn debygol o fod yn:

source: deed poll documents, either enrolled or unenrolled
cy: dogfennau gweithred newid enw, naill ai wedi'u cofrestru neu heb eu cofrestru

source: change of name documents (Scotland)
cy: dogfennau newid enw (Yr Alban)

source: statutory declarations
cy: datganiadau statudol

source: Have you ever been in a marriage or civil partnership that ended for another reason?
cy: Ydych chi erioed wedi bod mewn partneriaeth sifil neu briodas a ddaeth i ben am reswm arall?

source: Use this tool to check which documents you need for your Gender Recognition Certificate application
cy: Defnyddiwch yr adnodd hwn i wirio pa ddogfennau sydd eu hangen arnoch ar gyfer eich cais am Dystysgrif Cydnabod Rhywedd

source: Answering the questions means we can give you a list of documents based on your personal circumstances
cy: Mae ateb y cwestiynau yn golygu y gallwn roi rhestr o ddogfennau i chi yn seiliedig ar eich amgylchiadau personol

source: You can have the list of documents sent to you by email at the end
cy: Gellir anfon y rhestr o ddogfennau atoch drwy e-bost ar y diwedd

source: This is not part of the application process and is designed only to help you prepare the documents you need before you start your application
cy: Nid yw hyn yn rhan o'r broses gwneud cais ac fe'i cynlluniwyd i'ch helpu i baratoi'r dogfennau sydd eu hangen arnoch cyn i chi ddechrau gwneud eich cais

source: We do not store any of the information you enter in this tool
cy: Nid ydym yn storio unrhyw wybodaeth rydych chi'n ei rhoi yn yr adnodd hwn

source: If you already have your documents ready you can
cy: Os oes gennych eich dogfennau eisoes yn barod,

source: start your application
cy: gallwch ddechrau gwneud eich cais

source: Documents you need to provide
cy: Dogfennau y mae angen i chi eu darparu

source: Based on your answers, these are the documents you need for your application
cy: Yn seiliedig ar eich atebion, dyma'r dogfennau sydd eu hangen arnoch ar gyfer eich cais

source: Some documents will be uploaded during the application process, while others need to be posted to us after you submit an application.
cy: Bydd rhai dogfennau'n cael eu llwytho yn ystod y broses gwneud cais, tra bod angen postio eraill atom ar ôl i chi gyflwyno cais.

source: Documents to upload
cy: Dogfennau i'w llwytho

source: You should upload a scan or good quality photograph of the following documents when you make your application
cy: Dylech lwytho sgan neu lun o ansawdd da o'r dogfennau canlynol pan fyddwch yn gwneud eich cais

source: Copies of all change of name documents
cy: Copïau o'r holl ddogfennau newid enw

source: If you’ve changed your name to reflect your affirmed gender, upload copies of all documents that show when you’ve done this
cy: Os ydych chi wedi newid eich enw i adlewyrchu eich rhywedd a gadarnhawyd, llwythwch gopïau o'r holl ddogfennau sy'n dangos pryd rydych chi wedi gwneud hyn

source: This includes enrolled or unenrolled deed polls and statutory declarations of name changes
cy: Mae hyn yn cynnwys gweithred newid enw gofrestredig neu anghofrestredig a datganiadau statudol o newidiadau enw

source: These copies do not need to be certified
cy: Nid oes angen i'r copïau hyn gael eu hardystio

source: Medical reports
cy: Adroddiadau meddygol

source: You need 2 reports written by either
cy: Mae arnoch angen 2 adroddiad wedi’u hysgrifennu gan naill ai

source: 2 different medical doctors registered in the UK
cy: 2 feddyg meddygol gwahanol wedi’u cofrestru yn y DU

source: a medical doctor and a clinical psychologist, both registered in the UK
cy: meddyg meddygol a seicolegydd clinigol, ill dau wedi’u cofrestru yn y DU

source: Neither of the reports can be written by a nurse practitioner
cy: Ni all yr un o’r adroddiadau fod wedi’u hysgrifennu gan ymarferydd nyrsio

source: The reports both need to include the name, practice address and contact details of the person who wrote the report
cy: Mae angen i’r ddau adroddiad gynnwys enw a chyfeiriad y practis a manylion cyswllt yr unigolyn a ysgrifennodd yr adroddiad

source: At least 1 of the 2 reports needs to include details of any gender affirmation treatment you’ve had or plan to have, including
cy: Mae angen i o leiaf 1 o’r 2 adroddiad gynnwys manylion unrhyw driniaeth cadarnhau rhywedd rydych wedi’i chael neu’n cynllunio i’w chael, gan gynnwys

source: any surgical treatments
cy: unrhyw driniaethau llawfeddygol

source: any non-surgical treatments, such as hormone therapy
cy: unrhyw driniaethau anfeddygol, megis therapi hormonau

source: if you’ve not had any treatment and do not plan to have any, why that’s the case
cy: os nad ydych wedi cael unrhyw driniaeth ac nid ydych yn bwriadu cael unrhyw driniaeth, pam felly

source: The first report needs to confirm your gender dysphoria diagnosis and the clinical history this was based on, including
cy: Mae angen i’r adroddiad cyntaf gadarnhau eich diagnosis dysfforia rhywedd a’r hanes clinigol yr oedd hwn yn seiliedig arno, gan gynnwys

source: who made the diagnosis
cy: pwy wnaeth y diagnosis

source: when the diagnosis was made
cy: pryd gwnaethpwyd y diagnosis

source: what evidence was used to make the diagnosis
cy: pa dystiolaeth a ddefnyddiwyd i wneud y diagnosis

source: This first report needs to be written by a registered doctor or clinical psychologist who practises in the field of gender dysphoria. You can find one of these by
cy: Mae angen i’r adroddiad cyntaf fod wedi’i ysgrifennu gan feddyg cofrestredig neu seicolegydd clinigol sy’n ymarfer ym maes dysfforia rhywedd. Gallwch ddod o hyd i un o’r rhain drwy

source: asking your GP for a referral
cy: ofyn i’ch meddyg teulu am atgyfeiriad

source: contacting someone on the
cy: cysylltu â rhywun ar y rhestr o

source: list of specialists in gender dysphoria (opens in a new tab)
cy: rhestr o arbenigwyr dysfforia rhywedd (yn agor mewn tab newydd)

source: this is not a complete list and it’s not always up-to-date
cy: nid yw hon yn rhestr gyflawn ac nid yw bob amser yn gyfredol

source: If your registered doctor or clinical psychologist is not on the list of specialists, ask them to include a brief summary of their experience of practising in the field of gender dysphoria
cy: Os nad yw eich meddyg cofrestredig neu’ch seicolegydd clinigol ar y rhestr o arbenigwyr, gofynnwch iddynt gynnwys crynodeb byr o’u profiad o ymarfer ym maes dysfforia rhywedd

source: The second report can be written by any registered doctor or clinical psychologist, including your GP, a surgeon or an endocrinologist
cy: Gall yr ail adroddiad fod wedi’i ysgrifennu gan unrhyw feddyg cofrestredig neu seicolegydd clinigol, gan gynnwys eich meddyg teulu, llawfeddyg neu endocrinolegydd

source: There’s no required content for this second report, and it can include the same information from the first report
cy: Nid oes yna wybodaeth y mae’n ofynnol i chi gynnwys yn yr ail adroddiad hwn, a gall gynnwys yr un wybodaeth â’r adroddiad cyntaf

source: The reports do not need to be specially written for your application, so long as they meet all the requirements
cy: Nid oes rhaid i’r adroddiadau fod wedi’u hysgrifennu’n arbennig ar gyfer eich cais, cyhyd â’u bod yn bodloni’r holl ofynion

source: You may already have suitable reports in your medical records
cy: Efallai bod gennych adroddiadau addas yn barod yn eich cofnodion meddygol

source: If you do need new reports written, you’ll probably need to pay for them even if you use NHS medical practitioners
cy: Os ydych angen i adroddiadau newydd gael eu hysgrifennu, mae’n debyg y bydd rhaid i chi dalu amdanynt hyd yn oed os byddwch yn defnyddio ymarferwyr meddygol GIG

source: There is a
cy: Mae yna

source: form that medical practitioners can use to write either of these reports (opens in a new tab)
cy: ffurflen y gall ymarferwyr meddygol ei defnyddio i ysgrifennu’r naill adroddiad neu’r llall (yn agor mewn tab newydd)

source: Evidence of living in your affirmed gender for 2 years
cy: Tystiolaeth eich bod wedi byw yn eich rhywedd a gadarnhawyd am 2 flynedd

source: You need copies of evidence to show that you’ve been living in your affirmed gender for the last 2 years
cy: Mae arnoch angen copïau o dystiolaeth i ddangos eich bod wedi bod yn byw yn eich rhywedd a gadarnhawyd am y 2 flynedd diwethaf

source: Each piece of evidence should contain at least one of the following that matches up with your affirmed gender
cy: Dylai pob darn o dystiolaeth gynnwys o leiaf un o’r canlynol sy’n cyfateb i’ch rhywedd a gadarnhawyd

source: a name
cy: enw

source: a title, like 'Mr' or 'Miss'
cy: teitl, megis ‘Mr’ neu ‘Miss’

source: a gender marker, like 'male' or 'female'
cy: rhywedd, megis ‘gwryw’ neu ‘benyw’

source: There are no other specific requirements for this evidence, but try to find
cy: Nid oes yna ofynion penodol eraill ar gyfer y dystiolaeth hon, ond ceisiwch ddod o hyd i

source: evidence from different points over the 2 years, with roughly 4 pieces of evidence from each year
cy: dystiolaeth o wahanol adegau dros y 2 flynedd, gydag oddeutu 4 darn o dystiolaeth o bob blwyddyn

source: at least one piece of evidence from the last 2 or 3 months
cy: o leiaf un darn o dystiolaeth o’r 2 neu 3 mis diwethaf

source: evidence from a variety of different sources
cy: tystiolaeth o amrywiaeth o ffynonellau gwahanol

source: The evidence can come from before you were diagnosed with gender dysphoria
cy: Gall y dystiolaeth fod o’r adeg cyn i chi gael diagnosis o dysfforia rhywedd

source: Examples of what you can upload include good quality photocopies or photographs of
cy: Mae enghreifftiau o beth allwch ei uwchlwytho yn cynnwys llungopïau neu luniau o ansawdd da o

source: your driving licence
cy: eich trwydded yrru

source: your passport
cy: eich pasbort

source: identity cards, like workplace IDs, student IDs, railcards, health insurance cards, library cards or supermarket loyalty cards
cy: cardiau adnabod, megis cerdyn adnabod gwaith, cerdyn adnabod myfyriwr, cerdyn rheilffordd, cerdyn yswiriant iechyd, cerdyn llyfrgell neu gerdyn teyrngarwch archfarchnad

source: letters from solicitors, accountants, doctors, dentists or employers
cy: llythyrau gan gyfreithwyr, cyfrifwyr, meddygon, deintyddion neu gyflogwyr

source: bank statements
cy: cyfriflenni banc

source: payslips, P60s and P45s
cy: slipiau cyflog, P60s a P45s

source: benefit letters
cy: llythyrau budd-daliadau

source: tax letters and documents, including council tax
cy: llythyrau a dogfennau treth, gan gynnwys treth y cyngor

source: credit reports
cy: adroddiadau credyd

source: confirmation letters that you’re on the electoral register
cy: llythyrau yn cadarnhau eich bod ar y gofrestr etholiadol

source: student loan statements
cy: cyfriflenni benthyciad myfyriwr

source: utility bills, such as internet bills
cy: bil cyfleustodau, megis biliau rhyngrwyd

source: rental agreements
cy: cytundebau rhentu

source: academic certificates and documents
cy: tystysgrifau a dogfennau academaidd

source: You might be asked to send in more evidence after you submit your application
cy: Efallai y gofynnir i chi anfon rhagor o dystiolaeth ar ôl i chi gyflwyno’ch cais

source: Statutory declaration for single applicants
cy: Datganiad statudol ar gyfer ceiswyr sengl

source: Fill in and sign a
cy: Llenwch a llofnodwch

source: statutory declaration (opens in a new tab)
cy: ddatganiad statudol (yn agor mewn tab newydd)

source: Follow the guidance to find out who can act as a witness when you sign your declaration
cy: Cyfeiriwch at y cyfarwyddyd i ddarganfod pwy all weithredu fel tyst pan fyddant yn llofnodi eu datganiad

source: Follow the guidance to find out who can act as a witness when they sign their declaration
cy: Cyfeiriwch at y cyfarwyddyd i ddarganfod pwy all weithredu fel tyst pan fyddant yn llofnodi eu datganiad

source: Death certificate for your spouse or civil partner
cy: Tystysgrif marwolaeth ar gyfer eich priod neu bartner sifil

source: Upload a death certificate for your partner if their death ended the marriage or civil partnership – you can
cy: Uwchlwythwch dystysgrif marwolaeth ar gyfer eich partner os daeth eu marwolaeth â’r briodas neu bartneriaeth sifil i ben – gallwch

source: order a death certificate (opens in a new tab)
cy: archebu tystysgrif marwolaeth (yn agor mewn tab newydd)

source: if their death was registered in the UK
cy: os cafodd eu marwolaeth ei chofrestru yn y DU

source: Decree absolute or final order
cy: Dyfarniad absoliwt neu orchymyn terfynol

source: Upload a scan or good quality photograph of your
cy: Uwchlwythwch sgan neu ffotograff o ansawdd da

source: decree absolute or final order (opens in a new tab)
cy: o’ch dyfarniad absoliwt neu orchymyn terfynol (yn agor mewn tab newydd)

source: to show the marriage or civil partnership has ended
cy: i ddangos bod y briodas neu’r bartneriaeth sifil wedi dod i ben

source: If you have been married or in a civil partnership more than once, you need a separate certificate for each marriage or civil partnership
cy: Os ydych wedi bod yn briod neu mewn partneriaeth sifil fwy nag unwaith, mae angen tystysgrif ar wahân arnoch ar gyfer pob priodas neu bartneriaeth sifil

source: Proof that your affirmed gender is recognised outside the UK
cy: Prawf bod eich rhywedd a gadarnhawyd yn cael ei gydnabod y tu allan i'r DU

source: If your affirmed gender is already recognised in an
cy: Os yw eich rhywedd a gadarnhawyd eisoes yn cael ei

source: approved country or territory (opens in a new tab)
cy: gydnabod mewn gwlad neu diriogaeth gymeradwy (yn agor mewn tab newydd)

source: you need a document that proves this
cy: mae angen dogfen arnoch sy'n profi hyn

source: The document could be
cy: Gallai'r ddogfen fod
