Repository: ministryofjustice/grc-app
Catalog: grc/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: These cookies are used across the GOV.UK Gender Recognition Certificate website
cy: Mae’r cwcis hyn yn cael eu defnyddio ar draws gwefan Tystysgrif Cydnabod Rhywedd GOV.UK

source: We only set cookies when JavaScript is running in your browser and you’ve accepted them
cy: Rydym ond yn gosod cwcis pan fydd JavaScript yn weithredol yn eich porwr ac rydych wedi eu derbyn

source: If you choose not to run Javascript, the information on this page will not apply to you
cy: Os dewiswch beidio â gweithredu Javascript, ni fydd yr wybodaeth ar y dudalen hon yn berthnasol i chi

source: Find out
cy: Cewch ragor o

source: how to manage cookies
cy: wybodaeth am sut i reoli cwcis

source: from the Information Commissioner's Office
cy: gan Swyddfa'r Comisiynydd Gwybodaeth

source: Essential cookies (strictly necessary)
cy: Cwcis hanfodol (cwbl angenrheidiol)

source: We use an essential cookie to remember when you accept or reject cookies on our website
cy: Rydym yn defnyddio cwci hanfodol i gofio pan fyddwch yn derbyn neu'n gwrthod cwcis ar ein gwefan

source: Essential cookies we use
cy: Cwcis hanfodol yr ydym yn eu defnyddio

source: Purpose
cy: Pwrpas

source: Expires
cy: Dyddiad dod i ben

source: Saves your progress on the website
cy: Cadw eich cynnydd ar y wefan

source: When you close your browser tab
cy: Pan fyddwch yn cau’r tab yn eich porwr

source: Saves your cookie consent settings
cy: Cadw eich gosodiadau caniatáu cwcis

source: 1 year
cy: 1 flynedd

source: Analytics cookies (optional)
cy: Cwcis Dadansoddol (dewisol)

source: We use Google Analytics software to understand how people use the GOV.UK Gender Recognition Certificate
cy: Rydym yn defnyddio meddalwedd Google Analytics i ddeall sut mae pobl yn defnyddio Tystysgrif Cydnabod Rhywedd GOV.UK

source: We do this to help make sure the site is meeting the needs of its users and to help us make improvements
cy: Rydym yn gwneud hyn i helpu i sicrhau bod y gwasanaeth yn diwallu anghenion ei ddefnyddwyr ac i’n helpu i wneud gwelliannau

source: We do not collect or store your personal information (for example your name or address) so this information cannot be used to identify who you are
cy: Nid ydym yn casglu nac yn cadw’ch gwybodaeth bersonol (er enghraifft, eich enw neu’ch cyfeiriad) felly ni ellir defnyddio’r wybodaeth hon i’ch adnabod

source: We do not allow Google to use or share our analytics data
cy: Nid ydym yn caniatáu i Google ddefnyddio neu rannu ein data dadansoddol

source: Google Analytics stores information about:
cy: Mae Google Analytics yn storio gwybodaeth am:

source: the pages you visit
cy: y tudalennau yr ydych yn ymweld â hwy

source: how long you spend on each page
cy: faint o amser y byddwch yn ei dreulio ar bob tudalen

source: how you arrived at the site
cy: sut y daethoch o hyd i’r gwasanaeth

source: what you click on while you visit the site
cy: yr hyn rydych chi’n clicio arno wrth ddefnyddio’r gwasanaeth

source: the device and browser you use
cy: y dyfais a’r porwr yr ydych yn ei ddefnyddio

source: Analytics cookies we use
cy: Cwcis dadansoddol yr ydym yn eu defnyddio

source: Helps us count how many people visit the GOV.UK Gender Recognition Certificate by telling us if you’ve visited before
cy: Mae yn ein helpu i gyfrif faint o bobl sy’n ymweld â Thystysgrif Cydnabod Rhywedd GOV.UK drwy wrthym os ydych wedi ymweld o'r blaen

source: 2 years
cy: 2 flynedd

source: 24 hours
cy: 24 awr

source: Used to reduce the number of requests
cy: Defnyddir hwn i leihau nifer y ceisiadau

source: 1 minute
cy: 1 munud

source: Do you want to accept analytics cookies?
cy: A ydych eisiau derbyn cwcis dadansoddol?

source: Save cookie settings
cy: Cadw gosodiadau cwcis

source: Privacy Policy
cy: Polisi Preifatrwydd

source: This page explains what kind of personal information the Government Equalities Office (GEO) holds about you when you apply for a Gender Recognition Certificate (GRC) using this service
cy: Mae’r dudalen hon yn esbonio pa fath o wybodaeth bersonol sydd gan Swyddfa Cydraddoldeb y Llywodraeth amdanoch chi pan fyddwch yn gwneud cais am Dystysgrif Cydnabod Rhywedd (GRC) gan ddefnyddio’r gwasanaeth hwn

source: It also explains how your personal information is protected and how you can find out about it
cy: Mae hefyd yn esbonio sut mae eich gwybodaeth bersonol yn cael ei diogelu a sut y gallwch gael gwybod amdani

source: What personal information we hold about you
cy: Pa wybodaeth bersonol sydd gennym amdanoch chi

source: We hold the following information about you:
cy: Rydym yn cadw'r wybodaeth ganlynol amdanoch:

source: personal details – name, email address, and telephone number
cy: Manylion personol – enw, cyfeiriad e-bost, a rhif ffôn

source: birth or adoption certificate details
cy: manylion tystysgrif geni neu fabwysiadu

source: medical information
cy: gwybodaeth feddygol

source: name change documentation
cy: dogfennaeth newid enw

source: National Insurance number
cy: Rhif Yswiriant Gwladol

source: We also hold documents relating to living in your affirmed gender including your:
cy: Rydym hefyd yn cadw dogfennau sy’n ymwneud â byw yn eich rhywedd a gadarnhawyd, gan gynnwys eich:

source: ID documentation
cy: dogfennaeth ID

source: passport
cy: pasbort

source: driver’s licence
cy: trwydded yrru

source: utility bills
cy: bil cyfleustodau

source: payslips
cy: papurau cyflog

source: tax letters
cy: llythyrau treth

source: academic statements
cy: datganiadau academaidd

source: We use your personal data to enable the submission of applications to the Gender Recognition team at HMCTS (HM Courts and Tribunals Service)
cy: Rydym yn defnyddio eich data personol i alluogi cyflwyno ceisiadau i’r tîm Cydnabod Rhywedd yn GLlTEF (Gwasanaeth Llysoedd a Thribiwnlysoedd EF)

source: Legal basis of processing
cy: Sail gyfreithiol dros brosesu

source: Processing is necessary for the performance of a task carried out in the public interest or in the compliance of legal obligations
cy: Mae prosesu yn angenrheidiol er mwyn cyflawni tasg a gyflawnir er budd y cyhoedd neu er mwyn cydymffurfio â rhwymedigaethau cyfreithiol

source: In particular:
cy: Yn benodol:

source: Allowing the submission of gender recognition certificate applications to the gender recognition panel
cy: Caniatáu cyflwyno ceisiadau am dystysgrif cydnabod rhywedd i'r panel cydnabod rhywedd

source: This is outlined in the Gender Recognition Act 2004
cy: Mae hyn yn cael ei amlinellu yn Neddf Cydnabod Rhywedd 2004

source: Sensitive personal data is personal data about your:
cy: Mae data personol sensitif yn ddata personol am eich:

source: racial or ethnic origin
cy: tarddiad hiliol neu darddiad ethnig

source: political opinions
cy: barnau gwleidyddol

source: religious or philosophical beliefs
cy: credoau crefyddol neu’ch credoau athronyddol

source: trade union membership
cy: aelodaeth undeb llafur

source: It also includes the processing of:
cy: Mae hefyd yn cynnwys prosesu:

source: genetic data, biometric data for the purpose of uniquely identifying a natural person
cy: data genetig a data biometrig at ddibenion adnabod unigolyn naturiol yn unigryw

source: data concerning health
cy: data am iechyd

source: data concerning a natural person's sex life or sexual orientation
cy: data sy’n ymwneud â bywyd rhywiol neu gyfeiriadedd rhywiol unigolyn naturiol

source: The legal basis for processing your sensitive personal data is necessary for the performance of a task carried out in the public interest or in the compliance of legal obligations
cy: Mae'r sail gyfreithiol ar gyfer prosesu eich data personol sensitif yn angenrheidiol er mwyn cyflawni tasg a gyflawnir er budd y cyhoedd neu wrth gydymffurfio â rhwymedigaethau cyfreithiol

source: As stated above
cy: Fel y nodwyd uchod

source: How long we keep your personal data
cy: Pa mor hir y byddwn yn cadw eich data personol

source: When you begin an application, or return to an existing application you will be sent an email with a pin number
cy: Pan fyddwch yn dechrau gwneud cais, neu’n dychwelyd at gais sy'n bodoli eisoes, anfonir e-bost atoch gyda rhif pin

source: If you do not use the pin to verify your email within 24 hours, you will need to start either the application or the log-in again and request a new pin
cy: Os na fyddwch yn defnyddio’r pin i ddilysu eich e-bost o fewn 24 awr, bydd angen i chi naill ai ddechrau’r cais neu fewngofnodi eto a gofyn am bin newydd

source: After you have started your application, we will keep your personal data for 6 calendar months from the date you last signed in
cy: Ar ôl i chi ddechrau gwneud eich cais, byddwn yn cadw eich data personol am 6 mis calendr o'r dyddiad y gwnaethoch fewngofnodi ddiwethaf

source: If you do not sign in within 6 calendar months we will permanently delete all personal identifiable data
cy: Os na fyddwch yn mewngofnodi o fewn 6 mis calendr, byddwn yn dileu’r holl ddata personol all eich adnabod, yn barhaol

source: We will warn you 3 months, one month and one week before we delete your data
cy: Byddwn yn eich rhybuddio o fewn 3 mis, mis ac wythnos cyn i ni ddileu eich data

source: After you have submitted your application, it is shared with the HMCTS Gender Recognition administration team
cy: Ar ôl i chi gyflwyno eich cais, caiff ei rannu gyda thîm gweinyddol Cydnabod Rhywedd GLlTEF

source: HMCTS will use your data to process your application and put it to the Gender Recognition panel for review
cy: Bydd GLlTEF yn defnyddio'ch data i brosesu eich cais a'i roi i'r panel Cydnabod Rhywedd i'w adolygu

source: See the
cy: Gweler

source: HMCTS privacy notice (opens in a new tab)
cy: hysbysiad preifatrwydd GLlTEF (yn agor mewn tab newydd)

source: for more information about how they process and hold your information
cy: am fwy o wybodaeth am sut maen nhw’n prosesu ac yn cadw eich gwybodaeth

source: We permanently delete your application from our online system after it has been reviewed by the Gender Recognition panel
cy: Rydym yn dileu eich cais yn barhaol o'n system ar-lein ar ôl iddo gael ei adolygu gan y panel Cydnabod Rhywedd

source: There is a separate
cy: Mae

source: privacy notice for GOV.UK Pay (opens in a new tab)
cy: hysbysiad preifatrwydd ar wahân ar gyfer GOV.UK Pay (yn agor mewn tab newydd)

source: the government's online payment service
cy: gwasanaeth talu ar-lein y llywodraeth

source: You will need to use GOV.UK Pay if you pay for your GRC application online
cy: Bydd angen i chi ddefnyddio GOV.UK Pay os ydych yn talu am eich cais GRC ar-lein

source: Sharing your information
cy: Rhannu eich gwybodaeth

source: When you submit your application, your data will be shared with the HMCTS Gender Recognition administration team
cy: Pan fyddwch yn cyflwyno eich cais, bydd eich data yn cael ei rannu gyda thîm gweinyddol Cydnabod Rhywedd GLlTEF

source: They require a secure login to access the data
cy: Mae arnynt angen manylion mewngofnodi diogel i gael mynediad i’r data

source: The data is not shared with any third parties or government departments, agencies or arms-length bodies
cy: Nid yw'r data yn cael ei rannu ag unrhyw drydydd partïon neu adrannau'r llywodraeth, asiantaethau neu gyrff hyd braich

source: Throughout the application process, information is shared with our email provider (GOV.UK Notify) and stored in our hosting provider (GOV.UK Platform as a Service) where this is needed to process your application
cy: Trwy gydol y broses gwneud cais, rhennir gwybodaeth gyda’n darparwr e-bost (GOV.UK Notify) a caiff ei storio yn ein darparwr cynnal (GOV.UK Platform as a Service) lle mae angen hwn i brosesu eich cais

source: It is also shared with our hosting suppliers and third-party IT support companies for the purposes of managing the site
cy: Mae hefyd yn cael ei rannu gyda’n cyflenwyr cynnal a chwmnïau cymorth TG trydydd parti at ddibenion rheoli’r wefan

source: There are some cases when your information can be shared for other reasons – for example, to prevent crime, respond to legal obligations or cooperate with public inquiries
cy: Mae rhai achosion pan fydd modd rhannu eich gwybodaeth am resymau eraill - er enghraifft, i atal troseddu, ymateb i rwymedigaethau cyfreithiol neu gydweithredu ag ymholiadau cyhoeddus

source: Your rights
cy: Eich hawliau

source: You can ask to see and correct the personal information we hold about you
cy: Gallwch ofyn i weld a chywiro’r wybodaeth bersonol sydd gennym amdanoch chi

source: You can do this by logging into your application
cy: Gallwch wneud hyn trwy fewngofnodi i'ch cais

source: In certain circumstances, you may also object to or restrict the processing of your data by GEO by making a request to
cy: Mewn rhai amgylchiadau, efallai y byddwch hefyd yn gwrthwynebu neu'n cyfyngu ar brosesu eich data gan GEO trwy wneud cais i

source: After you have submitted your application, you will no longer be able to log in to access the 'apply for a gender recognition certificate' service
cy: Ar ôl i chi gyflwyno’ch cais, ni fyddwch bellach yn gallu mewngofnodi i gael mynediad i’r gwasanaeth ‘gwneud cais am dystysgrif cydnabod rhywedd'

source: To ask for your data to be amended or deleted after you have submitted an application, email:
cy: I ofyn i’ch data gael ei ddiwygio neu ei ddileu ar ôl i chi gyflwyno cais, e-bostiwch:

source: Preparation of this privacy notice
cy: Paratoi'r hysbysiad preifatrwydd hwn

source: This privacy notice was first published on 28 June 2022
cy: Cyhoeddwyd yr hysbysiad preifatrwydd hwn yn gyntaf ar 28 Mehefin 2022

source: We have carried out a data protection impact assessment
cy: Rydym wedi cynnal asesiad o effaith diogelu data

source: We will use the impact assessment to keep track of any changes to the way your personal data is processed, and will update this notice if any changes arise
cy: Byddwn yn defnyddio’r asesiad o effaith i gadw llygaid ar unrhyw newidiadau i'r ffordd y caiff eich data personol ei brosesu, a byddwn yn diweddaru'r hysbysiad hwn os bydd unrhyw newidiadau'n codi

source: Contact Details
cy: Manylion Cyswllt

source: The data controller for your personal data is HM Courts and Tribunals Service
cy: Y rheolydd data ar gyfer eich data personol yw Gwasanaeth Llysoedd a Thribiwnlysoedd EF

source: The contact details for the data controller are:
cy: Y manylion cyswllt ar gyfer y rheolydd data yw:

source: How to make a complaint
cy: Sut i gwyno

source: When we ask you for information, we will keep to the law
cy: Pan ofynnwn i chi am wybodaeth, byddwn yn cadw at y gyfraith

source: If you consider that your information has been handled incorrectly, you can contact the Information Commissioner for independent advice about data protection
cy: Os ydych yn teimlo bod eich gwybodaeth wedi cael ei thrin yn anghywir, gallwch gysylltu â’r Comisiynydd Gwybodaeth am gyngor annibynnol ar ddiogelu data

source: You can contact the Information Commissioner at:
cy: Gallwch gysylltu â’r Comisiynydd Gwybodaeth yn:

source: Application saved
cy: Mae eich cais wedi’i gadw

source: Your reference number is:
cy: Eich cyfeirnod yw:

source: You will need your reference number to
cy: Byddwch angen eich

source: return to your application
cy: cyfeirnod i ddychwelyd i’ch cais

source: Keep a record of it – it can't be recovered if you lose it.
cy: Cadwch gofnod ohono - ni allwch ei gael yn ôl os byddwch yn ei golli.

source: It's safe to close this window.
cy: Mae'n saff i chi gau'r ffenestr hon yn awr.

source: This application has already been submitted
cy: Mae'r cais hwn eisoes wedi'i gyflwyno

source: An application with this reference number has already been submitted
cy: Mae cais gyda'r cyfeirnod hwn eisoes wedi'i gyflwyno

source: Notifying the General Register Office
cy: Hysbysu’r Swyddfa Gofrestru Gyffredinol

source: If you were born in the UK, the Gender Recognition Panel will tell the relevant General Register Office about your application
cy: Os cawsoch eich geni yn y DU, bydd y Panel Cydnabod Rhywedd yn hysbysu’r Swyddfa Gofrestru Gyffredinol berthnasol am eich cais

source: This will include telling them if you are married or in a civil partnership registered in England and Wales or Scotland and you are applying for gender recognition while remaining married or in a civil partnership
cy: Bydd hyn yn cynnwys dweud wrthynt os ydych wedi priodi neu mewn partneriaeth sifil sydd wedi’i chofrestru yng Nghymru a Lloegr neu’r Alban a’ch bod yn gwneud cais am gydnabod rhywedd tra rydych yn briod neu mewn partneriaeth sifil

source: After you receive your certificate, the General Register Office will contact you about your new birth certificate and, if appropriate, a new certificate for your marriage or civil partnership
cy: Ar ôl i chi gael eich tystysgrif, bydd y Swyddfa Gofrestru Gyffredinol yn cysylltu â chi ynghylch eich tystysgrif geni newydd ac, os yw’n berthnasol, tystysgrif priodas neu dystysgrif partneriaeth sifil newydd

source: Do you consent to the General Register Office contacting you about your application?
cy: Ydych chi’n rhoi caniatâd i’r Swyddfa Gofrestru Gyffredinol gysylltu â chi ynglŷn â’ch cais?

source: I consent
cy: Rwy’n rhoi caniatâd

source: You need to provide an email address to apply for a Gender Recognition Certificate using this service
cy: Mae angen i chi ddarparu cyfeiriad e-bost i ddefnyddio’r gwasanaeth hwn i wneud cais am Dystysgrif Cydnabod Rhywedd

source: This is so we can save your progress and you can return to your application later
cy: Y rheswm dros hyn yw er mwyn i ni allu cadw eich cais ac i chi allu dychwelyd i’ch cais yn hwyrach ymlaen

source: If you are returning to your application, you will need your application reference number
cy: Os ydych yn dychwelyd i’ch cais, byddwch angen cyfeirnod eich cais

source: If you have lost or forgotten it, you can start a new application
cy: Os ydych wedi’i golli neu ei anghofio, gallwch ddechrau cais newydd

source: Have you already started an application?
cy: Ydych chi eisoes wedi cychwyn gwneud cais?

source: You will need to start a new application
cy: Bydd angen i chi ddechrau cais newydd

source: Reference number
cy: Cyfeirnod

source: Gender recognition in approved countries and territories
cy: Cydnabod rhywedd mewn gwledydd a thiriogaethau cymeradwy

source: If you have ever been issued a Gender Recognition Certificate (or its equivalent) in an approved country or territory, you will need to provide official documentation that shows this
cy: Os ydych erioed wedi cael Tystysgrif Cydnabod Rhywedd (neu dystysgrif cyfwerth) mewn gwlad neu diriogaeth cymeradwy, bydd angen i chi ddarparu dogfennaeth swyddogol sy’n dangos hyn

source: This could be
cy: Gallai hyn fod yn

source: a document equal to a Gender Recognition Certificate
cy: ddogfen sy'n cyfateb i Dystysgrif Cydnabod Rhywedd

source: If you have received gender recognition from somewhere else, or you can’t provide this documentation, you will need to provide medical reports and evidence of living in your gender for 2 years instead
cy: Os ydych wedi cael statws cydnabod rhywedd mewn rhyw ffordd arall, neu os na allwch ddarparu’r ddogfennaeth hon, bydd angen i chi ddarparu adroddiadau meddygol a thystiolaeth eich bod wedi bod yn byw yn eich rhywedd ers 2 flynedd

source: List of approved countries and territories
cy: Rhestr o wledydd a thiriogaethau cymeradwy

source: Do you have official documentation that shows you have ever been issued a Gender Recognition Certificate (or its equivalent) in one of these countries or territories?
cy: A oes gennych chi ddogfennaeth swyddogol sy’n dangos eich bod wedi cael Tystysgrif Cydnabod Rhywedd (neu dystysgrif cyfwerth) yn un o’r gwledydd neu diriogaethau hyn?

source: Select ‘No’ if you have received gender recognition from somewhere else, or you can’t provide this documentation.
cy: Dewiswch ‘Nac oes’ os ydych wedi cael statws cydnabod rhywedd gan wlad neu diriogaeth arall, neu os na allwch ddarparu’r ddogfennaeth hon.

source: Have you ever been issued a Gender Recognition Certificate (or its equivalent) in another country?
cy: Ydych chi erioed wedi cael Tystysgrif Cydnabod Rhywedd (neu dystysgrif cyfwerth) mewn gwlad arall?

source: Your reference number
cy: Eich cyfeirnod

source: We will automatically save your application as you progress
cy: Byddwn yn cadw eich cais yn awtomatig wrth i chi ei gwblhau

source: Your reference number is
cy: Eich cyfeirnod yw

source: You will need your reference number to return to your application
cy: Byddwch angen eich cyfeirnod i ddychwelyd i’ch cais

source: Keep a record of it – it can't be recovered if you lose it
cy: Cadwch gofnod ohono - ni allwch ei gael yn ôl os byddwch yn ei golli

source: Check your answers before sending your application
cy: Gwiriwch eich atebion cyn anfon eich cais

source: Do you have official documentation that shows you have ever been issued a Gender Recognition Certificate (or its equivalent) in one of the allowed countries or territories?
cy: A oes gennych chi ddogfennaeth swyddogol sy'n dangos eich bod wedi cael Tystysgrif Cydnabod Rhywedd (neu dystysgrif cyfwerth) yn un o'r gwledydd neu diriogaethau a ganiateir?

source: Name (as you would like it to appear on your Gender Recognition Certificate)
cy: Enw (fel yr hoffech iddo ymddangos ar eich Tystysgrif Cydnabod Rhywedd)

source: to
cy: at

source: Maiden name
cy: Enw cyn priodi

source: Forces registering service, British Consul or High Commission, or under Merchant Shipping or Civil Aviation provisions
cy: Gwasanaeth cofrestru’r Lluoedd, Conswl Prydeinig neu Uchel Gomisiwn, neu dan ddarpariaethau Llongau Masnach neu Hedfan Sifil

source: Your uploaded documents
cy: Y dogfennau rydych wedi’u huwchlwytho

source: Marriage documents
cy: Dogfennau priodas

source: Payment details
cy: Manylion talu

source: Payment method
cy: Dull talu

source: Help type
cy: Math o help

source: Help with Fees reference number
cy: Cyfeirnod Help i Dalu Ffioedd

source: Documents you'll need to post
cy: Dogfennau y bydd angen i chi eu postio

source: Based on your application the documents that will need to be posted are:
cy: Yn seiliedig ar eich cais, y dogfennau y bydd angen i chi eu postio yw:

source: Download your application
cy: Lawrlwytho eich cais

source: If you want to keep a record of the details you are submitting, you can
cy: Os ydych eisiau cadw cofnod o’r manylion yr ydych yn eu cyflwyno, gallwch

source: download a pdf copy
cy: lawrlwytho copi pdf

source: Now send your application
cy: Nawr anfonwch eich cais

source: I certify that all information given in this application is correct and that I understand making a false application is an offence.
cy: Rwy’n ardystio bod yr holl wybodaeth a roddwyd yn y cais hwn yn gywir ac rwy’n deall bod gwneud cais ffug yn drosedd.

source: Submit application
cy: Cyflwyno’r cais

source: Submit application and pay online
cy: Cyflwyno’r cais a thalu ar-lein

source: Application submitted
cy: Cais wedi'i gyflwyno

source: You should post all remaining documents to us as soon as possible
cy: Dylech bostio’r holl ddogfennau eraill atom cyn gynted â phosibl

source: We have sent you a confirmation email.
cy: Rydym wedi anfon e-bost cadarnhau atoch.

source: What you need to do next
cy: Beth sydd angen i chi ei wneud nesaf

source: Post your birth or adoption certificate to us as soon as possible – include your name, address and application reference number so we can match it to your application.
cy: Postiwch eich tystysgrif geni neu dystysgrif mabwysiadu atom cyn gynted â phosibl - dylech gynnwys eich enw, cyfeiriad a chyfeirnod eich cais fel y gallwn ei pharu â’ch cais.
